Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xab8 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x9c0e): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x572ae): ../App/Src/interrupt.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1ae85): C:/2_data/VisualStudio/FaHoverBoard/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 7 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x4dc40): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x2d6da): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1f716): unsigned char
 <1><44>: Abbrev Number: 5 (DW_TAG_typedef)
    <45>   DW_AT_name        : (indirect string, offset: 0x7c4dc): __int16_t
    <49>   DW_AT_decl_file   : 3
    <4a>   DW_AT_decl_line   : 55
    <4b>   DW_AT_decl_column : 24
    <4c>   DW_AT_type        : <0x50>
 <1><50>: Abbrev Number: 7 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 5	(signed)
    <53>   DW_AT_name        : (indirect string, offset: 0x74130): short int
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x33271): short unsigned int
 <1><5e>: Abbrev Number: 7 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xd726): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x6336a): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x24e6b): long unsigned int
 <1><78>: Abbrev Number: 7 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x47613): long long int
 <1><7f>: Abbrev Number: 7 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x20177): long long unsigned int
 <1><86>: Abbrev Number: 24 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 7 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xd026): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2d6dc): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x7c4de): int16_t
    <aa>   DW_AT_decl_file   : 4
    <ab>   DW_AT_decl_line   : 32
    <ac>   DW_AT_decl_column : 19
    <ad>   DW_AT_type        : <0x44>
 <1><b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x712c9): uint32_t
    <b6>   DW_AT_decl_file   : 4
    <b7>   DW_AT_decl_line   : 48
    <b8>   DW_AT_decl_column : 20
    <b9>   DW_AT_type        : <0x65>
 <1><bd>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <be>   DW_AT_type        : <0xb1>
 <1><c2>: Abbrev Number: 10 (DW_TAG_const_type)
    <c3>   DW_AT_type        : <0xbd>
 <1><c7>: Abbrev Number: 16 (DW_TAG_structure_type)
    <c8>   DW_AT_byte_size   : 140
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 374
    <cc>   DW_AT_decl_column : 9
    <cc>   DW_AT_sibling     : <0x1f7>
 <2><d0>: Abbrev Number: 1 (DW_TAG_member)
    <d1>   DW_AT_name        : (indirect string, offset: 0x8e6e9): CPUID
    <d5>   DW_AT_decl_file   : 5
    <d6>   DW_AT_decl_line   : 376
    <d8>   DW_AT_decl_column : 18
    <d9>   DW_AT_type        : <0xc2>
    <dd>   DW_AT_data_member_location: 0
 <2><de>: Abbrev Number: 1 (DW_TAG_member)
    <df>   DW_AT_name        : (indirect string, offset: 0x323f9): ICSR
    <e3>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 377
    <e6>   DW_AT_decl_column : 18
    <e7>   DW_AT_type        : <0xbd>
    <eb>   DW_AT_data_member_location: 4
 <2><ec>: Abbrev Number: 1 (DW_TAG_member)
    <ed>   DW_AT_name        : (indirect string, offset: 0x5b03): VTOR
    <f1>   DW_AT_decl_file   : 5
    <f2>   DW_AT_decl_line   : 378
    <f4>   DW_AT_decl_column : 18
    <f5>   DW_AT_type        : <0xbd>
    <f9>   DW_AT_data_member_location: 8
 <2><fa>: Abbrev Number: 1 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0x976ce): AIRCR
    <ff>   DW_AT_decl_file   : 5
    <100>   DW_AT_decl_line   : 379
    <102>   DW_AT_decl_column : 18
    <103>   DW_AT_type        : <0xbd>
    <107>   DW_AT_data_member_location: 12
 <2><108>: Abbrev Number: 4 (DW_TAG_member)
    <109>   DW_AT_name        : SCR
    <10d>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 380
    <110>   DW_AT_decl_column : 18
    <111>   DW_AT_type        : <0xbd>
    <115>   DW_AT_data_member_location: 16
 <2><116>: Abbrev Number: 4 (DW_TAG_member)
    <117>   DW_AT_name        : CCR
    <11b>   DW_AT_decl_file   : 5
    <11c>   DW_AT_decl_line   : 381
    <11e>   DW_AT_decl_column : 18
    <11f>   DW_AT_type        : <0xbd>
    <123>   DW_AT_data_member_location: 20
 <2><124>: Abbrev Number: 4 (DW_TAG_member)
    <125>   DW_AT_name        : SHP
    <129>   DW_AT_decl_file   : 5
    <12a>   DW_AT_decl_line   : 382
    <12c>   DW_AT_decl_column : 18
    <12d>   DW_AT_type        : <0x207>
    <131>   DW_AT_data_member_location: 24
 <2><132>: Abbrev Number: 1 (DW_TAG_member)
    <133>   DW_AT_name        : (indirect string, offset: 0x5299c): SHCSR
    <137>   DW_AT_decl_file   : 5
    <138>   DW_AT_decl_line   : 383
    <13a>   DW_AT_decl_column : 18
    <13b>   DW_AT_type        : <0xbd>
    <13f>   DW_AT_data_member_location: 36
 <2><140>: Abbrev Number: 1 (DW_TAG_member)
    <141>   DW_AT_name        : (indirect string, offset: 0x626be): CFSR
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 384
    <148>   DW_AT_decl_column : 18
    <149>   DW_AT_type        : <0xbd>
    <14d>   DW_AT_data_member_location: 40
 <2><14e>: Abbrev Number: 1 (DW_TAG_member)
    <14f>   DW_AT_name        : (indirect string, offset: 0x5594c): HFSR
    <153>   DW_AT_decl_file   : 5
    <154>   DW_AT_decl_line   : 385
    <156>   DW_AT_decl_column : 18
    <157>   DW_AT_type        : <0xbd>
    <15b>   DW_AT_data_member_location: 44
 <2><15c>: Abbrev Number: 1 (DW_TAG_member)
    <15d>   DW_AT_name        : (indirect string, offset: 0x7f5e7): DFSR
    <161>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 386
    <164>   DW_AT_decl_column : 18
    <165>   DW_AT_type        : <0xbd>
    <169>   DW_AT_data_member_location: 48
 <2><16a>: Abbrev Number: 1 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x8d013): MMFAR
    <16f>   DW_AT_decl_file   : 5
    <170>   DW_AT_decl_line   : 387
    <172>   DW_AT_decl_column : 18
    <173>   DW_AT_type        : <0xbd>
    <177>   DW_AT_data_member_location: 52
 <2><178>: Abbrev Number: 1 (DW_TAG_member)
    <179>   DW_AT_name        : (indirect string, offset: 0x3fb85): BFAR
    <17d>   DW_AT_decl_file   : 5
    <17e>   DW_AT_decl_line   : 388
    <180>   DW_AT_decl_column : 18
    <181>   DW_AT_type        : <0xbd>
    <185>   DW_AT_data_member_location: 56
 <2><186>: Abbrev Number: 1 (DW_TAG_member)
    <187>   DW_AT_name        : (indirect string, offset: 0x28cd1): AFSR
    <18b>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 389
    <18e>   DW_AT_decl_column : 18
    <18f>   DW_AT_type        : <0xbd>
    <193>   DW_AT_data_member_location: 60
 <2><194>: Abbrev Number: 4 (DW_TAG_member)
    <195>   DW_AT_name        : PFR
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 390
    <19c>   DW_AT_decl_column : 18
    <19d>   DW_AT_type        : <0x221>
    <1a1>   DW_AT_data_member_location: 64
 <2><1a2>: Abbrev Number: 4 (DW_TAG_member)
    <1a3>   DW_AT_name        : DFR
    <1a7>   DW_AT_decl_file   : 5
    <1a8>   DW_AT_decl_line   : 391
    <1aa>   DW_AT_decl_column : 18
    <1ab>   DW_AT_type        : <0xc2>
    <1af>   DW_AT_data_member_location: 72
 <2><1b0>: Abbrev Number: 4 (DW_TAG_member)
    <1b1>   DW_AT_name        : ADR
    <1b5>   DW_AT_decl_file   : 5
    <1b6>   DW_AT_decl_line   : 392
    <1b8>   DW_AT_decl_column : 18
    <1b9>   DW_AT_type        : <0xc2>
    <1bd>   DW_AT_data_member_location: 76
 <2><1be>: Abbrev Number: 1 (DW_TAG_member)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x3ea1f): MMFR
    <1c3>   DW_AT_decl_file   : 5
    <1c4>   DW_AT_decl_line   : 393
    <1c6>   DW_AT_decl_column : 18
    <1c7>   DW_AT_type        : <0x23b>
    <1cb>   DW_AT_data_member_location: 80
 <2><1cc>: Abbrev Number: 1 (DW_TAG_member)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x929d4): ISAR
    <1d1>   DW_AT_decl_file   : 5
    <1d2>   DW_AT_decl_line   : 394
    <1d4>   DW_AT_decl_column : 18
    <1d5>   DW_AT_type        : <0x255>
    <1d9>   DW_AT_data_member_location: 96
 <2><1da>: Abbrev Number: 1 (DW_TAG_member)
    <1db>   DW_AT_name        : (indirect string, offset: 0x925b1): RESERVED0
    <1df>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 395
    <1e2>   DW_AT_decl_column : 18
    <1e3>   DW_AT_type        : <0x25a>
    <1e7>   DW_AT_data_member_location: 116
 <2><1e8>: Abbrev Number: 1 (DW_TAG_member)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x3f8dd): CPACR
    <1ed>   DW_AT_decl_file   : 5
    <1ee>   DW_AT_decl_line   : 396
    <1f0>   DW_AT_decl_column : 18
    <1f1>   DW_AT_type        : <0xbd>
    <1f5>   DW_AT_data_member_location: 136
 <2><1f6>: Abbrev Number: 0
 <1><1f7>: Abbrev Number: 11 (DW_TAG_array_type)
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_sibling     : <0x207>
 <2><200>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <201>   DW_AT_type        : <0x8d>
    <205>   DW_AT_upper_bound : 11
 <2><206>: Abbrev Number: 0
 <1><207>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <208>   DW_AT_type        : <0x1f7>
 <1><20c>: Abbrev Number: 11 (DW_TAG_array_type)
    <20d>   DW_AT_type        : <0xc2>
    <211>   DW_AT_sibling     : <0x21c>
 <2><215>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <216>   DW_AT_type        : <0x8d>
    <21a>   DW_AT_upper_bound : 1
 <2><21b>: Abbrev Number: 0
 <1><21c>: Abbrev Number: 10 (DW_TAG_const_type)
    <21d>   DW_AT_type        : <0x20c>
 <1><221>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <222>   DW_AT_type        : <0x21c>
 <1><226>: Abbrev Number: 11 (DW_TAG_array_type)
    <227>   DW_AT_type        : <0xc2>
    <22b>   DW_AT_sibling     : <0x236>
 <2><22f>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <230>   DW_AT_type        : <0x8d>
    <234>   DW_AT_upper_bound : 3
 <2><235>: Abbrev Number: 0
 <1><236>: Abbrev Number: 10 (DW_TAG_const_type)
    <237>   DW_AT_type        : <0x226>
 <1><23b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <23c>   DW_AT_type        : <0x236>
 <1><240>: Abbrev Number: 11 (DW_TAG_array_type)
    <241>   DW_AT_type        : <0xc2>
    <245>   DW_AT_sibling     : <0x250>
 <2><249>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <24a>   DW_AT_type        : <0x8d>
    <24e>   DW_AT_upper_bound : 4
 <2><24f>: Abbrev Number: 0
 <1><250>: Abbrev Number: 10 (DW_TAG_const_type)
    <251>   DW_AT_type        : <0x240>
 <1><255>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <256>   DW_AT_type        : <0x250>
 <1><25a>: Abbrev Number: 11 (DW_TAG_array_type)
    <25b>   DW_AT_type        : <0xb1>
    <25f>   DW_AT_sibling     : <0x26a>
 <2><263>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <264>   DW_AT_type        : <0x8d>
    <268>   DW_AT_upper_bound : 4
 <2><269>: Abbrev Number: 0
 <1><26a>: Abbrev Number: 9 (DW_TAG_typedef)
    <26b>   DW_AT_name        : (indirect string, offset: 0x729c9): SCB_Type
    <26f>   DW_AT_decl_file   : 5
    <270>   DW_AT_decl_line   : 397
    <272>   DW_AT_decl_column : 3
    <273>   DW_AT_type        : <0xc7>
 <1><277>: Abbrev Number: 16 (DW_TAG_structure_type)
    <278>   DW_AT_byte_size   : 16
    <279>   DW_AT_decl_file   : 6
    <27a>   DW_AT_decl_line   : 360
    <27c>   DW_AT_decl_column : 9
    <27c>   DW_AT_sibling     : <0x2b9>
 <2><280>: Abbrev Number: 4 (DW_TAG_member)
    <281>   DW_AT_name        : CCR
    <285>   DW_AT_decl_file   : 6
    <286>   DW_AT_decl_line   : 362
    <288>   DW_AT_decl_column : 17
    <289>   DW_AT_type        : <0xbd>
    <28d>   DW_AT_data_member_location: 0
 <2><28e>: Abbrev Number: 1 (DW_TAG_member)
    <28f>   DW_AT_name        : (indirect string, offset: 0x3c2f6): CNDTR
    <293>   DW_AT_decl_file   : 6
    <294>   DW_AT_decl_line   : 363
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0xbd>
    <29b>   DW_AT_data_member_location: 4
 <2><29c>: Abbrev Number: 1 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x958c1): CPAR
    <2a1>   DW_AT_decl_file   : 6
    <2a2>   DW_AT_decl_line   : 364
    <2a4>   DW_AT_decl_column : 17
    <2a5>   DW_AT_type        : <0xbd>
    <2a9>   DW_AT_data_member_location: 8
 <2><2aa>: Abbrev Number: 1 (DW_TAG_member)
    <2ab>   DW_AT_name        : (indirect string, offset: 0x5610b): CMAR
    <2af>   DW_AT_decl_file   : 6
    <2b0>   DW_AT_decl_line   : 365
    <2b2>   DW_AT_decl_column : 17
    <2b3>   DW_AT_type        : <0xbd>
    <2b7>   DW_AT_data_member_location: 12
 <2><2b8>: Abbrev Number: 0
 <1><2b9>: Abbrev Number: 9 (DW_TAG_typedef)
    <2ba>   DW_AT_name        : (indirect string, offset: 0x7f1d5): DMA_Channel_TypeDef
    <2be>   DW_AT_decl_file   : 6
    <2bf>   DW_AT_decl_line   : 366
    <2c1>   DW_AT_decl_column : 3
    <2c2>   DW_AT_type        : <0x277>
 <1><2c6>: Abbrev Number: 16 (DW_TAG_structure_type)
    <2c7>   DW_AT_byte_size   : 8
    <2c8>   DW_AT_decl_file   : 6
    <2c9>   DW_AT_decl_line   : 368
    <2cb>   DW_AT_decl_column : 9
    <2cb>   DW_AT_sibling     : <0x2ec>
 <2><2cf>: Abbrev Number: 4 (DW_TAG_member)
    <2d0>   DW_AT_name        : ISR
    <2d4>   DW_AT_decl_file   : 6
    <2d5>   DW_AT_decl_line   : 370
    <2d7>   DW_AT_decl_column : 17
    <2d8>   DW_AT_type        : <0xbd>
    <2dc>   DW_AT_data_member_location: 0
 <2><2dd>: Abbrev Number: 1 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x6d14c): IFCR
    <2e2>   DW_AT_decl_file   : 6
    <2e3>   DW_AT_decl_line   : 371
    <2e5>   DW_AT_decl_column : 17
    <2e6>   DW_AT_type        : <0xbd>
    <2ea>   DW_AT_data_member_location: 4
 <2><2eb>: Abbrev Number: 0
 <1><2ec>: Abbrev Number: 9 (DW_TAG_typedef)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x38a57): DMA_TypeDef
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 372
    <2f4>   DW_AT_decl_column : 3
    <2f5>   DW_AT_type        : <0x2c6>
 <1><2f9>: Abbrev Number: 16 (DW_TAG_structure_type)
    <2fa>   DW_AT_byte_size   : 84
    <2fb>   DW_AT_decl_file   : 6
    <2fc>   DW_AT_decl_line   : 628
    <2fe>   DW_AT_decl_column : 9
    <2fe>   DW_AT_sibling     : <0x427>
 <2><302>: Abbrev Number: 4 (DW_TAG_member)
    <303>   DW_AT_name        : CR1
    <307>   DW_AT_decl_file   : 6
    <308>   DW_AT_decl_line   : 630
    <30a>   DW_AT_decl_column : 17
    <30b>   DW_AT_type        : <0xbd>
    <30f>   DW_AT_data_member_location: 0
 <2><310>: Abbrev Number: 4 (DW_TAG_member)
    <311>   DW_AT_name        : CR2
    <315>   DW_AT_decl_file   : 6
    <316>   DW_AT_decl_line   : 631
    <318>   DW_AT_decl_column : 17
    <319>   DW_AT_type        : <0xbd>
    <31d>   DW_AT_data_member_location: 4
 <2><31e>: Abbrev Number: 1 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0x6fee0): SMCR
    <323>   DW_AT_decl_file   : 6
    <324>   DW_AT_decl_line   : 632
    <326>   DW_AT_decl_column : 17
    <327>   DW_AT_type        : <0xbd>
    <32b>   DW_AT_data_member_location: 8
 <2><32c>: Abbrev Number: 1 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x31d08): DIER
    <331>   DW_AT_decl_file   : 6
    <332>   DW_AT_decl_line   : 633
    <334>   DW_AT_decl_column : 17
    <335>   DW_AT_type        : <0xbd>
    <339>   DW_AT_data_member_location: 12
 <2><33a>: Abbrev Number: 4 (DW_TAG_member)
    <33b>   DW_AT_name        : SR
    <33e>   DW_AT_decl_file   : 6
    <33f>   DW_AT_decl_line   : 634
    <341>   DW_AT_decl_column : 17
    <342>   DW_AT_type        : <0xbd>
    <346>   DW_AT_data_member_location: 16
 <2><347>: Abbrev Number: 4 (DW_TAG_member)
    <348>   DW_AT_name        : EGR
    <34c>   DW_AT_decl_file   : 6
    <34d>   DW_AT_decl_line   : 635
    <34f>   DW_AT_decl_column : 17
    <350>   DW_AT_type        : <0xbd>
    <354>   DW_AT_data_member_location: 20
 <2><355>: Abbrev Number: 1 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x8dc6e): CCMR1
    <35a>   DW_AT_decl_file   : 6
    <35b>   DW_AT_decl_line   : 636
    <35d>   DW_AT_decl_column : 17
    <35e>   DW_AT_type        : <0xbd>
    <362>   DW_AT_data_member_location: 24
 <2><363>: Abbrev Number: 1 (DW_TAG_member)
    <364>   DW_AT_name        : (indirect string, offset: 0x3e2b7): CCMR2
    <368>   DW_AT_decl_file   : 6
    <369>   DW_AT_decl_line   : 637
    <36b>   DW_AT_decl_column : 17
    <36c>   DW_AT_type        : <0xbd>
    <370>   DW_AT_data_member_location: 28
 <2><371>: Abbrev Number: 1 (DW_TAG_member)
    <372>   DW_AT_name        : (indirect string, offset: 0x204ff): CCER
    <376>   DW_AT_decl_file   : 6
    <377>   DW_AT_decl_line   : 638
    <379>   DW_AT_decl_column : 17
    <37a>   DW_AT_type        : <0xbd>
    <37e>   DW_AT_data_member_location: 32
 <2><37f>: Abbrev Number: 4 (DW_TAG_member)
    <380>   DW_AT_name        : CNT
    <384>   DW_AT_decl_file   : 6
    <385>   DW_AT_decl_line   : 639
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0xbd>
    <38c>   DW_AT_data_member_location: 36
 <2><38d>: Abbrev Number: 4 (DW_TAG_member)
    <38e>   DW_AT_name        : PSC
    <392>   DW_AT_decl_file   : 6
    <393>   DW_AT_decl_line   : 640
    <395>   DW_AT_decl_column : 17
    <396>   DW_AT_type        : <0xbd>
    <39a>   DW_AT_data_member_location: 40
 <2><39b>: Abbrev Number: 4 (DW_TAG_member)
    <39c>   DW_AT_name        : ARR
    <3a0>   DW_AT_decl_file   : 6
    <3a1>   DW_AT_decl_line   : 641
    <3a3>   DW_AT_decl_column : 17
    <3a4>   DW_AT_type        : <0xbd>
    <3a8>   DW_AT_data_member_location: 44
 <2><3a9>: Abbrev Number: 4 (DW_TAG_member)
    <3aa>   DW_AT_name        : RCR
    <3ae>   DW_AT_decl_file   : 6
    <3af>   DW_AT_decl_line   : 642
    <3b1>   DW_AT_decl_column : 17
    <3b2>   DW_AT_type        : <0xbd>
    <3b6>   DW_AT_data_member_location: 48
 <2><3b7>: Abbrev Number: 1 (DW_TAG_member)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x12a3c): CCR1
    <3bc>   DW_AT_decl_file   : 6
    <3bd>   DW_AT_decl_line   : 643
    <3bf>   DW_AT_decl_column : 17
    <3c0>   DW_AT_type        : <0xbd>
    <3c4>   DW_AT_data_member_location: 52
 <2><3c5>: Abbrev Number: 1 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x417b9): CCR2
    <3ca>   DW_AT_decl_file   : 6
    <3cb>   DW_AT_decl_line   : 644
    <3cd>   DW_AT_decl_column : 17
    <3ce>   DW_AT_type        : <0xbd>
    <3d2>   DW_AT_data_member_location: 56
 <2><3d3>: Abbrev Number: 1 (DW_TAG_member)
    <3d4>   DW_AT_name        : (indirect string, offset: 0x2c9dd): CCR3
    <3d8>   DW_AT_decl_file   : 6
    <3d9>   DW_AT_decl_line   : 645
    <3db>   DW_AT_decl_column : 17
    <3dc>   DW_AT_type        : <0xbd>
    <3e0>   DW_AT_data_member_location: 60
 <2><3e1>: Abbrev Number: 1 (DW_TAG_member)
    <3e2>   DW_AT_name        : (indirect string, offset: 0xa088): CCR4
    <3e6>   DW_AT_decl_file   : 6
    <3e7>   DW_AT_decl_line   : 646
    <3e9>   DW_AT_decl_column : 17
    <3ea>   DW_AT_type        : <0xbd>
    <3ee>   DW_AT_data_member_location: 64
 <2><3ef>: Abbrev Number: 1 (DW_TAG_member)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x4802c): BDTR
    <3f4>   DW_AT_decl_file   : 6
    <3f5>   DW_AT_decl_line   : 647
    <3f7>   DW_AT_decl_column : 17
    <3f8>   DW_AT_type        : <0xbd>
    <3fc>   DW_AT_data_member_location: 68
 <2><3fd>: Abbrev Number: 4 (DW_TAG_member)
    <3fe>   DW_AT_name        : DCR
    <402>   DW_AT_decl_file   : 6
    <403>   DW_AT_decl_line   : 648
    <405>   DW_AT_decl_column : 17
    <406>   DW_AT_type        : <0xbd>
    <40a>   DW_AT_data_member_location: 72
 <2><40b>: Abbrev Number: 1 (DW_TAG_member)
    <40c>   DW_AT_name        : (indirect string, offset: 0x85edc): DMAR
    <410>   DW_AT_decl_file   : 6
    <411>   DW_AT_decl_line   : 649
    <413>   DW_AT_decl_column : 17
    <414>   DW_AT_type        : <0xbd>
    <418>   DW_AT_data_member_location: 76
 <2><419>: Abbrev Number: 4 (DW_TAG_member)
    <41a>   DW_AT_name        : OR
    <41d>   DW_AT_decl_file   : 6
    <41e>   DW_AT_decl_line   : 650
    <420>   DW_AT_decl_column : 17
    <421>   DW_AT_type        : <0xbd>
    <425>   DW_AT_data_member_location: 80
 <2><426>: Abbrev Number: 0
 <1><427>: Abbrev Number: 9 (DW_TAG_typedef)
    <428>   DW_AT_name        : (indirect string, offset: 0x2145e): TIM_TypeDef
    <42c>   DW_AT_decl_file   : 6
    <42d>   DW_AT_decl_line   : 651
    <42f>   DW_AT_decl_column : 2
    <430>   DW_AT_type        : <0x2f9>
 <1><434>: Abbrev Number: 7 (DW_TAG_base_type)
    <435>   DW_AT_byte_size   : 8
    <436>   DW_AT_encoding    : 4	(float)
    <437>   DW_AT_name        : (indirect string, offset: 0x38a1b): long double
 <1><43b>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <43c>   DW_AT_encoding    : 7	(unsigned)
    <43c>   DW_AT_byte_size   : 1
    <43c>   DW_AT_type        : <0x3d>
    <440>   DW_AT_decl_file   : 7
    <441>   DW_AT_decl_line   : 50
    <442>   DW_AT_decl_column : 1
    <442>   DW_AT_sibling     : <0x453>
 <2><446>: Abbrev Number: 3 (DW_TAG_enumerator)
    <447>   DW_AT_name        : (indirect string, offset: 0x7324b): HAL_UNLOCKED
    <44b>   DW_AT_const_value : 0
 <2><44c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <44d>   DW_AT_name        : (indirect string, offset: 0x9b005): HAL_LOCKED
    <451>   DW_AT_const_value : 1
 <2><452>: Abbrev Number: 0
 <1><453>: Abbrev Number: 5 (DW_TAG_typedef)
    <454>   DW_AT_name        : (indirect string, offset: 0x5bcbf): HAL_LockTypeDef
    <458>   DW_AT_decl_file   : 7
    <459>   DW_AT_decl_line   : 53
    <45a>   DW_AT_decl_column : 3
    <45b>   DW_AT_type        : <0x43b>
 <1><45f>: Abbrev Number: 18 (DW_TAG_structure_type)
    <460>   DW_AT_byte_size   : 28
    <461>   DW_AT_decl_file   : 8
    <462>   DW_AT_decl_line   : 47
    <463>   DW_AT_decl_column : 9
    <463>   DW_AT_sibling     : <0x4c3>
 <2><467>: Abbrev Number: 2 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0xa76ab): Direction
    <46c>   DW_AT_decl_file   : 8
    <46d>   DW_AT_decl_line   : 49
    <46e>   DW_AT_decl_column : 12
    <46f>   DW_AT_type        : <0xb1>
    <473>   DW_AT_data_member_location: 0
 <2><474>: Abbrev Number: 2 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xa9f7): PeriphInc
    <479>   DW_AT_decl_file   : 8
    <47a>   DW_AT_decl_line   : 53
    <47b>   DW_AT_decl_column : 12
    <47c>   DW_AT_type        : <0xb1>
    <480>   DW_AT_data_member_location: 4
 <2><481>: Abbrev Number: 2 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0x18208): MemInc
    <486>   DW_AT_decl_file   : 8
    <487>   DW_AT_decl_line   : 56
    <488>   DW_AT_decl_column : 12
    <489>   DW_AT_type        : <0xb1>
    <48d>   DW_AT_data_member_location: 8
 <2><48e>: Abbrev Number: 2 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0x4d405): PeriphDataAlignment
    <493>   DW_AT_decl_file   : 8
    <494>   DW_AT_decl_line   : 59
    <495>   DW_AT_decl_column : 12
    <496>   DW_AT_type        : <0xb1>
    <49a>   DW_AT_data_member_location: 12
 <2><49b>: Abbrev Number: 2 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0x8c9b1): MemDataAlignment
    <4a0>   DW_AT_decl_file   : 8
    <4a1>   DW_AT_decl_line   : 62
    <4a2>   DW_AT_decl_column : 12
    <4a3>   DW_AT_type        : <0xb1>
    <4a7>   DW_AT_data_member_location: 16
 <2><4a8>: Abbrev Number: 2 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x9f9e1): Mode
    <4ad>   DW_AT_decl_file   : 8
    <4ae>   DW_AT_decl_line   : 65
    <4af>   DW_AT_decl_column : 12
    <4b0>   DW_AT_type        : <0xb1>
    <4b4>   DW_AT_data_member_location: 20
 <2><4b5>: Abbrev Number: 2 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0xa6b03): Priority
    <4ba>   DW_AT_decl_file   : 8
    <4bb>   DW_AT_decl_line   : 70
    <4bc>   DW_AT_decl_column : 12
    <4bd>   DW_AT_type        : <0xb1>
    <4c1>   DW_AT_data_member_location: 24
 <2><4c2>: Abbrev Number: 0
 <1><4c3>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c4>   DW_AT_name        : (indirect string, offset: 0x29b5f): DMA_InitTypeDef
    <4c8>   DW_AT_decl_file   : 8
    <4c9>   DW_AT_decl_line   : 72
    <4ca>   DW_AT_decl_column : 3
    <4cb>   DW_AT_type        : <0x45f>
 <1><4cf>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <4d0>   DW_AT_encoding    : 7	(unsigned)
    <4d0>   DW_AT_byte_size   : 1
    <4d0>   DW_AT_type        : <0x3d>
    <4d4>   DW_AT_decl_file   : 8
    <4d5>   DW_AT_decl_line   : 78
    <4d6>   DW_AT_decl_column : 1
    <4d6>   DW_AT_sibling     : <0x4f3>
 <2><4da>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4db>   DW_AT_name        : (indirect string, offset: 0x74430): HAL_DMA_STATE_RESET
    <4df>   DW_AT_const_value : 0
 <2><4e0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x2a970): HAL_DMA_STATE_READY
    <4e5>   DW_AT_const_value : 1
 <2><4e6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4e7>   DW_AT_name        : (indirect string, offset: 0x6bf3d): HAL_DMA_STATE_BUSY
    <4eb>   DW_AT_const_value : 2
 <2><4ec>: Abbrev Number: 3 (DW_TAG_enumerator)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x985c5): HAL_DMA_STATE_TIMEOUT
    <4f1>   DW_AT_const_value : 3
 <2><4f2>: Abbrev Number: 0
 <1><4f3>: Abbrev Number: 5 (DW_TAG_typedef)
    <4f4>   DW_AT_name        : (indirect string, offset: 0x67c65): HAL_DMA_StateTypeDef
    <4f8>   DW_AT_decl_file   : 8
    <4f9>   DW_AT_decl_line   : 83
    <4fa>   DW_AT_decl_column : 2
    <4fb>   DW_AT_type        : <0x4cf>
 <1><4ff>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <500>   DW_AT_type        : <0x4f3>
 <1><504>: Abbrev Number: 25 (DW_TAG_structure_type)
    <505>   DW_AT_name        : (indirect string, offset: 0x84c3e): __DMA_HandleTypeDef
    <509>   DW_AT_byte_size   : 68
    <50a>   DW_AT_decl_file   : 8
    <50b>   DW_AT_decl_line   : 110
    <50c>   DW_AT_decl_column : 16
    <50d>   DW_AT_sibling     : <0x5ae>
 <2><511>: Abbrev Number: 2 (DW_TAG_member)
    <512>   DW_AT_name        : (indirect string, offset: 0x3cb13): Instance
    <516>   DW_AT_decl_file   : 8
    <517>   DW_AT_decl_line   : 112
    <518>   DW_AT_decl_column : 31
    <519>   DW_AT_type        : <0x5ae>
    <51d>   DW_AT_data_member_location: 0
 <2><51e>: Abbrev Number: 2 (DW_TAG_member)
    <51f>   DW_AT_name        : (indirect string, offset: 0x9d0b7): Init
    <523>   DW_AT_decl_file   : 8
    <524>   DW_AT_decl_line   : 114
    <525>   DW_AT_decl_column : 30
    <526>   DW_AT_type        : <0x4c3>
    <52a>   DW_AT_data_member_location: 4
 <2><52b>: Abbrev Number: 2 (DW_TAG_member)
    <52c>   DW_AT_name        : (indirect string, offset: 0x6f1c8): Lock
    <530>   DW_AT_decl_file   : 8
    <531>   DW_AT_decl_line   : 116
    <532>   DW_AT_decl_column : 30
    <533>   DW_AT_type        : <0x453>
    <537>   DW_AT_data_member_location: 32
 <2><538>: Abbrev Number: 2 (DW_TAG_member)
    <539>   DW_AT_name        : (indirect string, offset: 0x9d2f3): State
    <53d>   DW_AT_decl_file   : 8
    <53e>   DW_AT_decl_line   : 118
    <53f>   DW_AT_decl_column : 30
    <540>   DW_AT_type        : <0x4ff>
    <544>   DW_AT_data_member_location: 33
 <2><545>: Abbrev Number: 2 (DW_TAG_member)
    <546>   DW_AT_name        : (indirect string, offset: 0x3115f): Parent
    <54a>   DW_AT_decl_file   : 8
    <54b>   DW_AT_decl_line   : 120
    <54c>   DW_AT_decl_column : 31
    <54d>   DW_AT_type        : <0x5b3>
    <551>   DW_AT_data_member_location: 36
 <2><552>: Abbrev Number: 2 (DW_TAG_member)
    <553>   DW_AT_name        : (indirect string, offset: 0x9a449): XferCpltCallback
    <557>   DW_AT_decl_file   : 8
    <558>   DW_AT_decl_line   : 122
    <559>   DW_AT_decl_column : 33
    <55a>   DW_AT_type        : <0x5c5>
    <55e>   DW_AT_data_member_location: 40
 <2><55f>: Abbrev Number: 2 (DW_TAG_member)
    <560>   DW_AT_name        : (indirect string, offset: 0x797cc): XferHalfCpltCallback
    <564>   DW_AT_decl_file   : 8
    <565>   DW_AT_decl_line   : 124
    <566>   DW_AT_decl_column : 33
    <567>   DW_AT_type        : <0x5c5>
    <56b>   DW_AT_data_member_location: 44
 <2><56c>: Abbrev Number: 2 (DW_TAG_member)
    <56d>   DW_AT_name        : (indirect string, offset: 0x16423): XferErrorCallback
    <571>   DW_AT_decl_file   : 8
    <572>   DW_AT_decl_line   : 126
    <573>   DW_AT_decl_column : 33
    <574>   DW_AT_type        : <0x5c5>
    <578>   DW_AT_data_member_location: 48
 <2><579>: Abbrev Number: 2 (DW_TAG_member)
    <57a>   DW_AT_name        : (indirect string, offset: 0x54361): XferAbortCallback
    <57e>   DW_AT_decl_file   : 8
    <57f>   DW_AT_decl_line   : 128
    <580>   DW_AT_decl_column : 33
    <581>   DW_AT_type        : <0x5c5>
    <585>   DW_AT_data_member_location: 52
 <2><586>: Abbrev Number: 2 (DW_TAG_member)
    <587>   DW_AT_name        : (indirect string, offset: 0x974d0): ErrorCode
    <58b>   DW_AT_decl_file   : 8
    <58c>   DW_AT_decl_line   : 130
    <58d>   DW_AT_decl_column : 30
    <58e>   DW_AT_type        : <0xbd>
    <592>   DW_AT_data_member_location: 56
 <2><593>: Abbrev Number: 2 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x42854): DmaBaseAddress
    <598>   DW_AT_decl_file   : 8
    <599>   DW_AT_decl_line   : 132
    <59a>   DW_AT_decl_column : 31
    <59b>   DW_AT_type        : <0x5ca>
    <59f>   DW_AT_data_member_location: 60
 <2><5a0>: Abbrev Number: 2 (DW_TAG_member)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x1ff38): ChannelIndex
    <5a5>   DW_AT_decl_file   : 8
    <5a6>   DW_AT_decl_line   : 134
    <5a7>   DW_AT_decl_column : 30
    <5a8>   DW_AT_type        : <0xb1>
    <5ac>   DW_AT_data_member_location: 64
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5af>   DW_AT_byte_size   : 4
    <5af>   DW_AT_type        : <0x2b9>
 <1><5b3>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <5b4>   DW_AT_byte_size   : 4
 <1><5b5>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <5b6>   DW_AT_prototyped  : 1
    <5b6>   DW_AT_sibling     : <0x5c0>
 <2><5ba>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <5bb>   DW_AT_type        : <0x5c0>
 <2><5bf>: Abbrev Number: 0
 <1><5c0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5c1>   DW_AT_byte_size   : 4
    <5c1>   DW_AT_type        : <0x504>
 <1><5c5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5c6>   DW_AT_byte_size   : 4
    <5c6>   DW_AT_type        : <0x5b5>
 <1><5ca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5cb>   DW_AT_byte_size   : 4
    <5cb>   DW_AT_type        : <0x2ec>
 <1><5cf>: Abbrev Number: 5 (DW_TAG_typedef)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x84c40): DMA_HandleTypeDef
    <5d4>   DW_AT_decl_file   : 8
    <5d5>   DW_AT_decl_line   : 136
    <5d6>   DW_AT_decl_column : 3
    <5d7>   DW_AT_type        : <0x504>
 <1><5db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5dc>   DW_AT_byte_size   : 4
    <5dc>   DW_AT_type        : <0x5cf>
 <1><5e0>: Abbrev Number: 18 (DW_TAG_structure_type)
    <5e1>   DW_AT_byte_size   : 24
    <5e2>   DW_AT_decl_file   : 9
    <5e3>   DW_AT_decl_line   : 46
    <5e4>   DW_AT_decl_column : 9
    <5e4>   DW_AT_sibling     : <0x637>
 <2><5e8>: Abbrev Number: 2 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x9fa14): Prescaler
    <5ed>   DW_AT_decl_file   : 9
    <5ee>   DW_AT_decl_line   : 48
    <5ef>   DW_AT_decl_column : 12
    <5f0>   DW_AT_type        : <0xb1>
    <5f4>   DW_AT_data_member_location: 0
 <2><5f5>: Abbrev Number: 2 (DW_TAG_member)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x8d2f1): CounterMode
    <5fa>   DW_AT_decl_file   : 9
    <5fb>   DW_AT_decl_line   : 51
    <5fc>   DW_AT_decl_column : 12
    <5fd>   DW_AT_type        : <0xb1>
    <601>   DW_AT_data_member_location: 4
 <2><602>: Abbrev Number: 2 (DW_TAG_member)
    <603>   DW_AT_name        : (indirect string, offset: 0xad784): Period
    <607>   DW_AT_decl_file   : 9
    <608>   DW_AT_decl_line   : 54
    <609>   DW_AT_decl_column : 12
    <60a>   DW_AT_type        : <0xb1>
    <60e>   DW_AT_data_member_location: 8
 <2><60f>: Abbrev Number: 2 (DW_TAG_member)
    <610>   DW_AT_name        : (indirect string, offset: 0x3f617): ClockDivision
    <614>   DW_AT_decl_file   : 9
    <615>   DW_AT_decl_line   : 58
    <616>   DW_AT_decl_column : 12
    <617>   DW_AT_type        : <0xb1>
    <61b>   DW_AT_data_member_location: 12
 <2><61c>: Abbrev Number: 2 (DW_TAG_member)
    <61d>   DW_AT_name        : (indirect string, offset: 0x6d224): RepetitionCounter
    <621>   DW_AT_decl_file   : 9
    <622>   DW_AT_decl_line   : 61
    <623>   DW_AT_decl_column : 12
    <624>   DW_AT_type        : <0xb1>
    <628>   DW_AT_data_member_location: 16
 <2><629>: Abbrev Number: 2 (DW_TAG_member)
    <62a>   DW_AT_name        : (indirect string, offset: 0xf7d7): AutoReloadPreload
    <62e>   DW_AT_decl_file   : 9
    <62f>   DW_AT_decl_line   : 72
    <630>   DW_AT_decl_column : 12
    <631>   DW_AT_type        : <0xb1>
    <635>   DW_AT_data_member_location: 20
 <2><636>: Abbrev Number: 0
 <1><637>: Abbrev Number: 5 (DW_TAG_typedef)
    <638>   DW_AT_name        : (indirect string, offset: 0x8b700): TIM_Base_InitTypeDef
    <63c>   DW_AT_decl_file   : 9
    <63d>   DW_AT_decl_line   : 74
    <63e>   DW_AT_decl_column : 3
    <63f>   DW_AT_type        : <0x5e0>
 <1><643>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <644>   DW_AT_encoding    : 7	(unsigned)
    <644>   DW_AT_byte_size   : 1
    <644>   DW_AT_type        : <0x3d>
    <648>   DW_AT_decl_file   : 9
    <648>   DW_AT_decl_line   : 291
    <64a>   DW_AT_decl_column : 1
    <64a>   DW_AT_sibling     : <0x66d>
 <2><64e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <64f>   DW_AT_name        : (indirect string, offset: 0x4e324): HAL_TIM_STATE_RESET
    <653>   DW_AT_const_value : 0
 <2><654>: Abbrev Number: 3 (DW_TAG_enumerator)
    <655>   DW_AT_name        : (indirect string, offset: 0x5dd5): HAL_TIM_STATE_READY
    <659>   DW_AT_const_value : 1
 <2><65a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <65b>   DW_AT_name        : (indirect string, offset: 0x273f9): HAL_TIM_STATE_BUSY
    <65f>   DW_AT_const_value : 2
 <2><660>: Abbrev Number: 3 (DW_TAG_enumerator)
    <661>   DW_AT_name        : (indirect string, offset: 0x82a3e): HAL_TIM_STATE_TIMEOUT
    <665>   DW_AT_const_value : 3
 <2><666>: Abbrev Number: 3 (DW_TAG_enumerator)
    <667>   DW_AT_name        : (indirect string, offset: 0x38f43): HAL_TIM_STATE_ERROR
    <66b>   DW_AT_const_value : 4
 <2><66c>: Abbrev Number: 0
 <1><66d>: Abbrev Number: 9 (DW_TAG_typedef)
    <66e>   DW_AT_name        : (indirect string, offset: 0x70e02): HAL_TIM_StateTypeDef
    <672>   DW_AT_decl_file   : 9
    <673>   DW_AT_decl_line   : 297
    <675>   DW_AT_decl_column : 3
    <676>   DW_AT_type        : <0x643>
 <1><67a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <67b>   DW_AT_type        : <0x66d>
 <1><67f>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <680>   DW_AT_encoding    : 7	(unsigned)
    <680>   DW_AT_byte_size   : 1
    <680>   DW_AT_type        : <0x3d>
    <684>   DW_AT_decl_file   : 9
    <684>   DW_AT_decl_line   : 303
    <686>   DW_AT_decl_column : 1
    <686>   DW_AT_sibling     : <0x69d>
 <2><68a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <68b>   DW_AT_name        : (indirect string, offset: 0x37677): HAL_TIM_CHANNEL_STATE_RESET
    <68f>   DW_AT_const_value : 0
 <2><690>: Abbrev Number: 3 (DW_TAG_enumerator)
    <691>   DW_AT_name        : (indirect string, offset: 0x5b808): HAL_TIM_CHANNEL_STATE_READY
    <695>   DW_AT_const_value : 1
 <2><696>: Abbrev Number: 3 (DW_TAG_enumerator)
    <697>   DW_AT_name        : (indirect string, offset: 0x4b08b): HAL_TIM_CHANNEL_STATE_BUSY
    <69b>   DW_AT_const_value : 2
 <2><69c>: Abbrev Number: 0
 <1><69d>: Abbrev Number: 9 (DW_TAG_typedef)
    <69e>   DW_AT_name        : (indirect string, offset: 0x20605): HAL_TIM_ChannelStateTypeDef
    <6a2>   DW_AT_decl_file   : 9
    <6a3>   DW_AT_decl_line   : 307
    <6a5>   DW_AT_decl_column : 3
    <6a6>   DW_AT_type        : <0x67f>
 <1><6aa>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <6ab>   DW_AT_type        : <0x69d>
 <1><6af>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <6b0>   DW_AT_encoding    : 7	(unsigned)
    <6b0>   DW_AT_byte_size   : 1
    <6b0>   DW_AT_type        : <0x3d>
    <6b4>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 313
    <6b6>   DW_AT_decl_column : 1
    <6b6>   DW_AT_sibling     : <0x6cd>
 <2><6ba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x3628): HAL_DMA_BURST_STATE_RESET
    <6bf>   DW_AT_const_value : 0
 <2><6c0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x55d8e): HAL_DMA_BURST_STATE_READY
    <6c5>   DW_AT_const_value : 1
 <2><6c6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c7>   DW_AT_name        : (indirect string, offset: 0x75095): HAL_DMA_BURST_STATE_BUSY
    <6cb>   DW_AT_const_value : 2
 <2><6cc>: Abbrev Number: 0
 <1><6cd>: Abbrev Number: 9 (DW_TAG_typedef)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x14ffc): HAL_TIM_DMABurstStateTypeDef
    <6d2>   DW_AT_decl_file   : 9
    <6d3>   DW_AT_decl_line   : 317
    <6d5>   DW_AT_decl_column : 3
    <6d6>   DW_AT_type        : <0x6af>
 <1><6da>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <6db>   DW_AT_type        : <0x6cd>
 <1><6df>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <6e0>   DW_AT_encoding    : 7	(unsigned)
    <6e0>   DW_AT_byte_size   : 1
    <6e0>   DW_AT_type        : <0x3d>
    <6e4>   DW_AT_decl_file   : 9
    <6e4>   DW_AT_decl_line   : 323
    <6e6>   DW_AT_decl_column : 1
    <6e6>   DW_AT_sibling     : <0x709>
 <2><6ea>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6eb>   DW_AT_name        : (indirect string, offset: 0x57712): HAL_TIM_ACTIVE_CHANNEL_1
    <6ef>   DW_AT_const_value : 1
 <2><6f0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6f1>   DW_AT_name        : (indirect string, offset: 0x5772b): HAL_TIM_ACTIVE_CHANNEL_2
    <6f5>   DW_AT_const_value : 2
 <2><6f6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x57744): HAL_TIM_ACTIVE_CHANNEL_3
    <6fb>   DW_AT_const_value : 4
 <2><6fc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6fd>   DW_AT_name        : (indirect string, offset: 0x5775d): HAL_TIM_ACTIVE_CHANNEL_4
    <701>   DW_AT_const_value : 8
 <2><702>: Abbrev Number: 3 (DW_TAG_enumerator)
    <703>   DW_AT_name        : (indirect string, offset: 0x405ea): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <707>   DW_AT_const_value : 0
 <2><708>: Abbrev Number: 0
 <1><709>: Abbrev Number: 9 (DW_TAG_typedef)
    <70a>   DW_AT_name        : (indirect string, offset: 0x1f54b): HAL_TIM_ActiveChannel
    <70e>   DW_AT_decl_file   : 9
    <70f>   DW_AT_decl_line   : 329
    <711>   DW_AT_decl_column : 3
    <712>   DW_AT_type        : <0x6df>
 <1><716>: Abbrev Number: 16 (DW_TAG_structure_type)
    <717>   DW_AT_byte_size   : 72
    <718>   DW_AT_decl_file   : 9
    <719>   DW_AT_decl_line   : 337
    <71b>   DW_AT_decl_column : 9
    <71b>   DW_AT_sibling     : <0x79e>
 <2><71f>: Abbrev Number: 1 (DW_TAG_member)
    <720>   DW_AT_name        : (indirect string, offset: 0x3cb13): Instance
    <724>   DW_AT_decl_file   : 9
    <725>   DW_AT_decl_line   : 340
    <727>   DW_AT_decl_column : 39
    <728>   DW_AT_type        : <0x79e>
    <72c>   DW_AT_data_member_location: 0
 <2><72d>: Abbrev Number: 1 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x9d0b7): Init
    <732>   DW_AT_decl_file   : 9
    <733>   DW_AT_decl_line   : 341
    <735>   DW_AT_decl_column : 38
    <736>   DW_AT_type        : <0x637>
    <73a>   DW_AT_data_member_location: 4
 <2><73b>: Abbrev Number: 1 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0x1f559): Channel
    <740>   DW_AT_decl_file   : 9
    <741>   DW_AT_decl_line   : 342
    <743>   DW_AT_decl_column : 38
    <744>   DW_AT_type        : <0x709>
    <748>   DW_AT_data_member_location: 28
 <2><749>: Abbrev Number: 1 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x5d74e): hdma
    <74e>   DW_AT_decl_file   : 9
    <74f>   DW_AT_decl_line   : 343
    <751>   DW_AT_decl_column : 39
    <752>   DW_AT_type        : <0x7a3>
    <756>   DW_AT_data_member_location: 32
 <2><757>: Abbrev Number: 1 (DW_TAG_member)
    <758>   DW_AT_name        : (indirect string, offset: 0x6f1c8): Lock
    <75c>   DW_AT_decl_file   : 9
    <75d>   DW_AT_decl_line   : 345
    <75f>   DW_AT_decl_column : 38
    <760>   DW_AT_type        : <0x453>
    <764>   DW_AT_data_member_location: 60
 <2><765>: Abbrev Number: 1 (DW_TAG_member)
    <766>   DW_AT_name        : (indirect string, offset: 0x9d2f3): State
    <76a>   DW_AT_decl_file   : 9
    <76b>   DW_AT_decl_line   : 346
    <76d>   DW_AT_decl_column : 38
    <76e>   DW_AT_type        : <0x67a>
    <772>   DW_AT_data_member_location: 61
 <2><773>: Abbrev Number: 1 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0xa87b0): ChannelState
    <778>   DW_AT_decl_file   : 9
    <779>   DW_AT_decl_line   : 347
    <77b>   DW_AT_decl_column : 38
    <77c>   DW_AT_type        : <0x7c3>
    <780>   DW_AT_data_member_location: 62
 <2><781>: Abbrev Number: 1 (DW_TAG_member)
    <782>   DW_AT_name        : (indirect string, offset: 0xa8c4e): ChannelNState
    <786>   DW_AT_decl_file   : 9
    <787>   DW_AT_decl_line   : 348
    <789>   DW_AT_decl_column : 38
    <78a>   DW_AT_type        : <0x7c3>
    <78e>   DW_AT_data_member_location: 66
 <2><78f>: Abbrev Number: 1 (DW_TAG_member)
    <790>   DW_AT_name        : (indirect string, offset: 0xa83da): DMABurstState
    <794>   DW_AT_decl_file   : 9
    <795>   DW_AT_decl_line   : 349
    <797>   DW_AT_decl_column : 38
    <798>   DW_AT_type        : <0x6da>
    <79c>   DW_AT_data_member_location: 70
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <79f>   DW_AT_byte_size   : 4
    <79f>   DW_AT_type        : <0x427>
 <1><7a3>: Abbrev Number: 11 (DW_TAG_array_type)
    <7a4>   DW_AT_type        : <0x5db>
    <7a8>   DW_AT_sibling     : <0x7b3>
 <2><7ac>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <7ad>   DW_AT_type        : <0x8d>
    <7b1>   DW_AT_upper_bound : 6
 <2><7b2>: Abbrev Number: 0
 <1><7b3>: Abbrev Number: 11 (DW_TAG_array_type)
    <7b4>   DW_AT_type        : <0x6aa>
    <7b8>   DW_AT_sibling     : <0x7c3>
 <2><7bc>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <7bd>   DW_AT_type        : <0x8d>
    <7c1>   DW_AT_upper_bound : 3
 <2><7c2>: Abbrev Number: 0
 <1><7c3>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <7c4>   DW_AT_type        : <0x7b3>
 <1><7c8>: Abbrev Number: 9 (DW_TAG_typedef)
    <7c9>   DW_AT_name        : (indirect string, offset: 0x35a5f): TIM_HandleTypeDef
    <7cd>   DW_AT_decl_file   : 9
    <7ce>   DW_AT_decl_line   : 380
    <7d0>   DW_AT_decl_column : 3
    <7d1>   DW_AT_type        : <0x716>
 <1><7d5>: Abbrev Number: 12 (DW_TAG_variable)
    <7d6>   DW_AT_name        : (indirect string, offset: 0x5ee6e): htim2
    <7da>   DW_AT_decl_file   : 10
    <7db>   DW_AT_decl_line   : 37
    <7dc>   DW_AT_decl_column : 26
    <7dd>   DW_AT_type        : <0x7c8>
    <7e1>   DW_AT_external    : 1
    <7e1>   DW_AT_declaration : 1
 <1><7e1>: Abbrev Number: 12 (DW_TAG_variable)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x5ee74): htim3
    <7e6>   DW_AT_decl_file   : 10
    <7e7>   DW_AT_decl_line   : 39
    <7e8>   DW_AT_decl_column : 26
    <7e9>   DW_AT_type        : <0x7c8>
    <7ed>   DW_AT_external    : 1
    <7ed>   DW_AT_declaration : 1
 <1><7ed>: Abbrev Number: 12 (DW_TAG_variable)
    <7ee>   DW_AT_name        : (indirect string, offset: 0x5ee95): htim5
    <7f2>   DW_AT_decl_file   : 10
    <7f3>   DW_AT_decl_line   : 43
    <7f4>   DW_AT_decl_column : 26
    <7f5>   DW_AT_type        : <0x7c8>
    <7f9>   DW_AT_external    : 1
    <7f9>   DW_AT_declaration : 1
 <1><7f9>: Abbrev Number: 12 (DW_TAG_variable)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x5ee9b): htim6
    <7fe>   DW_AT_decl_file   : 10
    <7ff>   DW_AT_decl_line   : 45
    <800>   DW_AT_decl_column : 26
    <801>   DW_AT_type        : <0x7c8>
    <805>   DW_AT_external    : 1
    <805>   DW_AT_declaration : 1
 <1><805>: Abbrev Number: 12 (DW_TAG_variable)
    <806>   DW_AT_name        : (indirect string, offset: 0x5eea1): htim7
    <80a>   DW_AT_decl_file   : 10
    <80b>   DW_AT_decl_line   : 47
    <80c>   DW_AT_decl_column : 26
    <80d>   DW_AT_type        : <0x7c8>
    <811>   DW_AT_external    : 1
    <811>   DW_AT_declaration : 1
 <1><811>: Abbrev Number: 28 (DW_TAG_enumeration_type)
    <812>   DW_AT_name        : (indirect string, offset: 0x7fa5f): MEASURED_TYPE
    <816>   DW_AT_encoding    : 7	(unsigned)
    <817>   DW_AT_byte_size   : 1
    <818>   DW_AT_type        : <0x3d>
    <81c>   DW_AT_decl_file   : 11
    <81d>   DW_AT_decl_line   : 13
    <81e>   DW_AT_decl_column : 6
    <81f>   DW_AT_sibling     : <0x82c>
 <2><823>: Abbrev Number: 22 (DW_TAG_enumerator)
    <824>   DW_AT_name        : M
    <826>   DW_AT_const_value : 0
 <2><827>: Abbrev Number: 22 (DW_TAG_enumerator)
    <828>   DW_AT_name        : T
    <82a>   DW_AT_const_value : 1
 <2><82b>: Abbrev Number: 0
 <1><82c>: Abbrev Number: 18 (DW_TAG_structure_type)
    <82d>   DW_AT_byte_size   : 8
    <82e>   DW_AT_decl_file   : 11
    <82f>   DW_AT_decl_line   : 18
    <830>   DW_AT_decl_column : 9
    <830>   DW_AT_sibling     : <0x85c>
 <2><834>: Abbrev Number: 2 (DW_TAG_member)
    <835>   DW_AT_name        : (indirect string, offset: 0x64fd0): type
    <839>   DW_AT_decl_file   : 11
    <83a>   DW_AT_decl_line   : 19
    <83b>   DW_AT_decl_column : 21
    <83c>   DW_AT_type        : <0x811>
    <840>   DW_AT_data_member_location: 0
 <2><841>: Abbrev Number: 2 (DW_TAG_member)
    <842>   DW_AT_name        : (indirect string, offset: 0x28fa8): measuredValue
    <846>   DW_AT_decl_file   : 11
    <847>   DW_AT_decl_line   : 20
    <848>   DW_AT_decl_column : 10
    <849>   DW_AT_type        : <0xa5>
    <84d>   DW_AT_data_member_location: 2
 <2><84e>: Abbrev Number: 2 (DW_TAG_member)
    <84f>   DW_AT_name        : (indirect string, offset: 0x51d90): timestamp
    <853>   DW_AT_decl_file   : 11
    <854>   DW_AT_decl_line   : 21
    <855>   DW_AT_decl_column : 11
    <856>   DW_AT_type        : <0xb1>
    <85a>   DW_AT_data_member_location: 4
 <2><85b>: Abbrev Number: 0
 <1><85c>: Abbrev Number: 5 (DW_TAG_typedef)
    <85d>   DW_AT_name        : (indirect string, offset: 0x6c693): EncoderData
    <861>   DW_AT_decl_file   : 11
    <862>   DW_AT_decl_line   : 22
    <863>   DW_AT_decl_column : 3
    <864>   DW_AT_type        : <0x82c>
 <1><868>: Abbrev Number: 5 (DW_TAG_typedef)
    <869>   DW_AT_name        : (indirect string, offset: 0x9cac2): BaseType_t
    <86d>   DW_AT_decl_file   : 12
    <86e>   DW_AT_decl_line   : 56
    <86f>   DW_AT_decl_column : 14
    <870>   DW_AT_type        : <0x5e>
 <1><874>: Abbrev Number: 10 (DW_TAG_const_type)
    <875>   DW_AT_type        : <0x868>
 <1><879>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <87a>   DW_AT_byte_size   : 4
    <87a>   DW_AT_type        : <0x885>
 <1><87e>: Abbrev Number: 7 (DW_TAG_base_type)
    <87f>   DW_AT_byte_size   : 1
    <880>   DW_AT_encoding    : 8	(unsigned char)
    <881>   DW_AT_name        : (indirect string, offset: 0x3281d): char
 <1><885>: Abbrev Number: 10 (DW_TAG_const_type)
    <886>   DW_AT_type        : <0x87e>
 <1><88a>: Abbrev Number: 5 (DW_TAG_typedef)
    <88b>   DW_AT_name        : (indirect string, offset: 0x468b1): osMessageQueueId_t
    <88f>   DW_AT_decl_file   : 13
    <890>   DW_AT_decl_line   : 207
    <891>   DW_AT_decl_column : 15
    <892>   DW_AT_type        : <0x5b3>
 <1><896>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <897>   DW_AT_byte_size   : 4
    <897>   DW_AT_type        : <0x8a0>
 <1><89b>: Abbrev Number: 10 (DW_TAG_const_type)
    <89c>   DW_AT_type        : <0x896>
 <1><8a0>: Abbrev Number: 29 (DW_TAG_const_type)
 <1><8a1>: Abbrev Number: 5 (DW_TAG_typedef)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x37f29): QueueHandle_t
    <8a6>   DW_AT_decl_file   : 14
    <8a7>   DW_AT_decl_line   : 48
    <8a8>   DW_AT_decl_column : 34
    <8a9>   DW_AT_type        : <0x8ad>
 <1><8ad>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8ae>   DW_AT_byte_size   : 4
    <8ae>   DW_AT_type        : <0x8b2>
 <1><8b2>: Abbrev Number: 30 (DW_TAG_structure_type)
    <8b3>   DW_AT_name        : (indirect string, offset: 0x1d019): QueueDefinition
    <8b7>   DW_AT_declaration : 1
 <1><8b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <8b8>   DW_AT_byte_size   : 4
    <8b8>   DW_AT_type        : <0x87e>
 <1><8bc>: Abbrev Number: 18 (DW_TAG_structure_type)
    <8bd>   DW_AT_byte_size   : 32
    <8be>   DW_AT_decl_file   : 15
    <8bf>   DW_AT_decl_line   : 21
    <8c0>   DW_AT_decl_column : 9
    <8c0>   DW_AT_sibling     : <0x919>
 <2><8c4>: Abbrev Number: 15 (DW_TAG_member)
    <8c5>   DW_AT_name        : R0
    <8c8>   DW_AT_decl_file   : 15
    <8c8>   DW_AT_decl_line   : 23
    <8c9>   DW_AT_decl_column : 12
    <8c9>   DW_AT_type        : <0xb1>
    <8cd>   DW_AT_data_member_location: 0
 <2><8ce>: Abbrev Number: 15 (DW_TAG_member)
    <8cf>   DW_AT_name        : R1
    <8d2>   DW_AT_decl_file   : 15
    <8d2>   DW_AT_decl_line   : 24
    <8d3>   DW_AT_decl_column : 12
    <8d3>   DW_AT_type        : <0xb1>
    <8d7>   DW_AT_data_member_location: 4
 <2><8d8>: Abbrev Number: 15 (DW_TAG_member)
    <8d9>   DW_AT_name        : R2
    <8dc>   DW_AT_decl_file   : 15
    <8dc>   DW_AT_decl_line   : 25
    <8dd>   DW_AT_decl_column : 12
    <8dd>   DW_AT_type        : <0xb1>
    <8e1>   DW_AT_data_member_location: 8
 <2><8e2>: Abbrev Number: 15 (DW_TAG_member)
    <8e3>   DW_AT_name        : R3
    <8e6>   DW_AT_decl_file   : 15
    <8e6>   DW_AT_decl_line   : 26
    <8e7>   DW_AT_decl_column : 12
    <8e7>   DW_AT_type        : <0xb1>
    <8eb>   DW_AT_data_member_location: 12
 <2><8ec>: Abbrev Number: 15 (DW_TAG_member)
    <8ed>   DW_AT_name        : R12
    <8f1>   DW_AT_decl_file   : 15
    <8f1>   DW_AT_decl_line   : 27
    <8f2>   DW_AT_decl_column : 12
    <8f2>   DW_AT_type        : <0xb1>
    <8f6>   DW_AT_data_member_location: 16
 <2><8f7>: Abbrev Number: 15 (DW_TAG_member)
    <8f8>   DW_AT_name        : LR
    <8fb>   DW_AT_decl_file   : 15
    <8fb>   DW_AT_decl_line   : 28
    <8fc>   DW_AT_decl_column : 12
    <8fc>   DW_AT_type        : <0xb1>
    <900>   DW_AT_data_member_location: 20
 <2><901>: Abbrev Number: 15 (DW_TAG_member)
    <902>   DW_AT_name        : PC
    <905>   DW_AT_decl_file   : 15
    <905>   DW_AT_decl_line   : 29
    <906>   DW_AT_decl_column : 12
    <906>   DW_AT_type        : <0xb1>
    <90a>   DW_AT_data_member_location: 24
 <2><90b>: Abbrev Number: 2 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x6d5b4): xPSR
    <910>   DW_AT_decl_file   : 15
    <911>   DW_AT_decl_line   : 30
    <912>   DW_AT_decl_column : 12
    <913>   DW_AT_type        : <0xb1>
    <917>   DW_AT_data_member_location: 28
 <2><918>: Abbrev Number: 0
 <1><919>: Abbrev Number: 5 (DW_TAG_typedef)
    <91a>   DW_AT_name        : (indirect string, offset: 0x752e8): HardFault_StackFrame_t
    <91e>   DW_AT_decl_file   : 15
    <91f>   DW_AT_decl_line   : 31
    <920>   DW_AT_decl_column : 3
    <921>   DW_AT_type        : <0x8bc>
 <1><925>: Abbrev Number: 12 (DW_TAG_variable)
    <926>   DW_AT_name        : (indirect string, offset: 0x38406): mEncoderQueueAHandle
    <92a>   DW_AT_decl_file   : 15
    <92b>   DW_AT_decl_line   : 33
    <92c>   DW_AT_decl_column : 27
    <92d>   DW_AT_type        : <0x88a>
    <931>   DW_AT_external    : 1
    <931>   DW_AT_declaration : 1
 <1><931>: Abbrev Number: 12 (DW_TAG_variable)
    <932>   DW_AT_name        : (indirect string, offset: 0x7a894): mEncoderQueueBHandle
    <936>   DW_AT_decl_file   : 15
    <937>   DW_AT_decl_line   : 34
    <938>   DW_AT_decl_column : 27
    <939>   DW_AT_type        : <0x88a>
    <93d>   DW_AT_external    : 1
    <93d>   DW_AT_declaration : 1
 <1><93d>: Abbrev Number: 12 (DW_TAG_variable)
    <93e>   DW_AT_name        : (indirect string, offset: 0x4fa97): ulHighFrequencyTimerTicks
    <942>   DW_AT_decl_file   : 15
    <943>   DW_AT_decl_line   : 36
    <944>   DW_AT_decl_column : 17
    <945>   DW_AT_type        : <0xb1>
    <949>   DW_AT_external    : 1
    <949>   DW_AT_declaration : 1
 <1><949>: Abbrev Number: 31 (DW_TAG_variable)
    <94a>   DW_AT_specification: <0x93d>
    <94e>   DW_AT_decl_file   : 1
    <94f>   DW_AT_decl_line   : 9
    <950>   DW_AT_decl_column : 10
    <951>   DW_AT_location    : 5 byte block: 3 5c 2 0 20 	(DW_OP_addr: 2000025c)
 <1><957>: Abbrev Number: 32 (DW_TAG_subprogram)
    <958>   DW_AT_external    : 1
    <958>   DW_AT_name        : (indirect string, offset: 0x7c745): vTaskList
    <95c>   DW_AT_decl_file   : 17
    <95d>   DW_AT_decl_line   : 1688
    <95f>   DW_AT_decl_column : 6
    <960>   DW_AT_prototyped  : 1
    <960>   DW_AT_declaration : 1
    <960>   DW_AT_sibling     : <0x96a>
 <2><964>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <965>   DW_AT_type        : <0x8b7>
 <2><969>: Abbrev Number: 0
 <1><96a>: Abbrev Number: 33 (DW_TAG_subprogram)
    <96b>   DW_AT_external    : 1
    <96b>   DW_AT_name        : (indirect string, offset: 0xac879): printf
    <96f>   DW_AT_decl_file   : 16
    <970>   DW_AT_decl_line   : 206
    <971>   DW_AT_decl_column : 5
    <972>   DW_AT_prototyped  : 1
    <972>   DW_AT_type        : <0x86>
    <976>   DW_AT_declaration : 1
    <976>   DW_AT_sibling     : <0x981>
 <2><97a>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <97b>   DW_AT_type        : <0x879>
 <2><97f>: Abbrev Number: 34 (DW_TAG_unspecified_parameters)
 <2><980>: Abbrev Number: 0
 <1><981>: Abbrev Number: 35 (DW_TAG_subprogram)
    <982>   DW_AT_external    : 1
    <982>   DW_AT_name        : (indirect string, offset: 0x91f71): xQueueGenericSendFromISR
    <986>   DW_AT_decl_file   : 14
    <987>   DW_AT_decl_line   : 1295
    <989>   DW_AT_decl_column : 12
    <98a>   DW_AT_prototyped  : 1
    <98a>   DW_AT_type        : <0x868>
    <98e>   DW_AT_declaration : 1
    <98e>   DW_AT_sibling     : <0x9a7>
 <2><992>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <993>   DW_AT_type        : <0x8a1>
 <2><997>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <998>   DW_AT_type        : <0x89b>
 <2><99c>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <99d>   DW_AT_type        : <0x9ac>
 <2><9a1>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <9a2>   DW_AT_type        : <0x874>
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9a8>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x868>
 <1><9ac>: Abbrev Number: 10 (DW_TAG_const_type)
    <9ad>   DW_AT_type        : <0x9a7>
 <1><9b1>: Abbrev Number: 36 (DW_TAG_subprogram)
    <9b2>   DW_AT_external    : 1
    <9b2>   DW_AT_name        : (indirect string, offset: 0x9b1f0): HAL_GetTick
    <9b6>   DW_AT_decl_file   : 18
    <9b7>   DW_AT_decl_line   : 297
    <9b9>   DW_AT_decl_column : 10
    <9ba>   DW_AT_prototyped  : 1
    <9ba>   DW_AT_type        : <0xb1>
    <9be>   DW_AT_declaration : 1
 <1><9be>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9bf>   DW_AT_external    : 1
    <9bf>   DW_AT_name        : (indirect string, offset: 0xe4e7): vPrintTaskList
    <9c3>   DW_AT_decl_file   : 1
    <9c3>   DW_AT_decl_line   : 55
    <9c4>   DW_AT_decl_column : 6
    <9c4>   DW_AT_prototyped  : 1
    <9c4>   DW_AT_low_pc      : 0x8001758
    <9c8>   DW_AT_high_pc     : 0x34
    <9cc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9ce>   DW_AT_call_all_tail_calls: 1
    <9ce>   DW_AT_sibling     : <0x9e2>
 <2><9d2>: Abbrev Number: 17 (DW_TAG_variable)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xd55a): pcTaskList
    <9d7>   DW_AT_decl_file   : 1
    <9d7>   DW_AT_decl_line   : 59
    <9d8>   DW_AT_decl_column : 10
    <9d9>   DW_AT_type        : <0x9e2>
    <9dd>   DW_AT_location    : 3 byte block: 91 f8 7b 	(DW_OP_fbreg: -520)
 <2><9e1>: Abbrev Number: 0
 <1><9e2>: Abbrev Number: 11 (DW_TAG_array_type)
    <9e3>   DW_AT_type        : <0x87e>
    <9e7>   DW_AT_sibling     : <0x9f3>
 <2><9eb>: Abbrev Number: 37 (DW_TAG_subrange_type)
    <9ec>   DW_AT_type        : <0x8d>
    <9f0>   DW_AT_upper_bound : 511
 <2><9f2>: Abbrev Number: 0
 <1><9f3>: Abbrev Number: 20 (DW_TAG_subprogram)
    <9f4>   DW_AT_external    : 1
    <9f4>   DW_AT_name        : (indirect string, offset: 0xb930): HardFault
    <9f8>   DW_AT_decl_file   : 1
    <9f8>   DW_AT_decl_line   : 40
    <9f9>   DW_AT_decl_column : 6
    <9f9>   DW_AT_prototyped  : 1
    <9f9>   DW_AT_low_pc      : 0x80016f0
    <9fd>   DW_AT_high_pc     : 0x68
    <a01>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a03>   DW_AT_call_all_tail_calls: 1
    <a03>   DW_AT_sibling     : <0xa2f>
 <2><a07>: Abbrev Number: 17 (DW_TAG_variable)
    <a08>   DW_AT_name        : (indirect string, offset: 0x37ace): stackFrame
    <a0c>   DW_AT_decl_file   : 1
    <a0c>   DW_AT_decl_line   : 43
    <a0d>   DW_AT_decl_column : 28
    <a0e>   DW_AT_type        : <0xa2f>
    <a12>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a15>: Abbrev Number: 38 (DW_TAG_inlined_subroutine)
    <a16>   DW_AT_abstract_origin: <0xa9f>
    <a1a>   DW_AT_low_pc      : 0x80016f6
    <a1e>   DW_AT_high_pc     : 0x8
    <a22>   DW_AT_call_file   : 1
    <a23>   DW_AT_call_line   : 43
    <a24>   DW_AT_call_column : 67
 <3><a25>: Abbrev Number: 39 (DW_TAG_variable)
    <a26>   DW_AT_abstract_origin: <0xaad>
    <a2a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><a2d>: Abbrev Number: 0
 <2><a2e>: Abbrev Number: 0
 <1><a2f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a30>   DW_AT_byte_size   : 4
    <a30>   DW_AT_type        : <0x919>
 <1><a34>: Abbrev Number: 20 (DW_TAG_subprogram)
    <a35>   DW_AT_external    : 1
    <a35>   DW_AT_name        : (indirect string, offset: 0x1e87e): HAL_TIM_PeriodElapsedCallback
    <a39>   DW_AT_decl_file   : 1
    <a39>   DW_AT_decl_line   : 11
    <a3a>   DW_AT_decl_column : 6
    <a3a>   DW_AT_prototyped  : 1
    <a3a>   DW_AT_low_pc      : 0x8001640
    <a3e>   DW_AT_high_pc     : 0xb0
    <a42>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a44>   DW_AT_call_all_tail_calls: 1
    <a44>   DW_AT_sibling     : <0xa9a>
 <2><a48>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <a49>   DW_AT_name        : (indirect string, offset: 0x7af24): htim
    <a4d>   DW_AT_decl_file   : 1
    <a4e>   DW_AT_decl_line   : 11
    <a4f>   DW_AT_decl_column : 55
    <a50>   DW_AT_type        : <0xa9a>
    <a54>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><a57>: Abbrev Number: 17 (DW_TAG_variable)
    <a58>   DW_AT_name        : (indirect string, offset: 0x59985): timeTick
    <a5c>   DW_AT_decl_file   : 1
    <a5c>   DW_AT_decl_line   : 12
    <a5d>   DW_AT_decl_column : 14
    <a5e>   DW_AT_type        : <0xb1>
    <a62>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a65>: Abbrev Number: 41 (DW_TAG_lexical_block)
    <a66>   DW_AT_low_pc      : 0x8001656
    <a6a>   DW_AT_high_pc     : 0x2a
    <a6e>   DW_AT_sibling     : <0xa81>
 <3><a72>: Abbrev Number: 17 (DW_TAG_variable)
    <a73>   DW_AT_name        : (indirect string, offset: 0xa5b1b): data
    <a77>   DW_AT_decl_file   : 1
    <a77>   DW_AT_decl_line   : 14
    <a78>   DW_AT_decl_column : 21
    <a79>   DW_AT_type        : <0x85c>
    <a7d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><a80>: Abbrev Number: 0
 <2><a81>: Abbrev Number: 42 (DW_TAG_lexical_block)
    <a82>   DW_AT_low_pc      : 0x800168a
    <a86>   DW_AT_high_pc     : 0x2a
 <3><a8a>: Abbrev Number: 17 (DW_TAG_variable)
    <a8b>   DW_AT_name        : (indirect string, offset: 0xa5b1b): data
    <a8f>   DW_AT_decl_file   : 1
    <a8f>   DW_AT_decl_line   : 25
    <a90>   DW_AT_decl_column : 21
    <a91>   DW_AT_type        : <0x85c>
    <a95>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><a98>: Abbrev Number: 0
 <2><a99>: Abbrev Number: 0
 <1><a9a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a9b>   DW_AT_byte_size   : 4
    <a9b>   DW_AT_type        : <0x7c8>
 <1><a9f>: Abbrev Number: 43 (DW_TAG_subprogram)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x5ce24): __get_MSP
    <aa4>   DW_AT_decl_file   : 2
    <aa5>   DW_AT_decl_line   : 301
    <aa7>   DW_AT_decl_column : 31
    <aa8>   DW_AT_prototyped  : 1
    <aa8>   DW_AT_type        : <0xb1>
    <aac>   DW_AT_inline      : 3	(declared as inline and inlined)
 <2><aad>: Abbrev Number: 44 (DW_TAG_variable)
    <aae>   DW_AT_name        : (indirect string, offset: 0xa0575): result
    <ab2>   DW_AT_decl_file   : 2
    <ab3>   DW_AT_decl_line   : 303
    <ab5>   DW_AT_decl_column : 12
    <ab6>   DW_AT_type        : <0xb1>
 <2><aba>: Abbrev Number: 0
 <1><abb>: Abbrev Number: 0
  Compilation Unit @ offset 0xabc:
   Length:        0x1d4 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x27c
   Pointer Size:  4
 <0><ac8>: Abbrev Number: 9 (DW_TAG_compile_unit)
    <ac9>   DW_AT_producer    : (indirect string, offset: 0x9c0e): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <acd>   DW_AT_language    : 29	(C11)
    <ace>   DW_AT_name        : (indirect string, offset: 0x9c015): ../Core/Src/algorithm/kalman.c
    <ad2>   DW_AT_comp_dir    : (indirect string, offset: 0x1ae85): C:/2_data/VisualStudio/FaHoverBoard/Debug
    <ad6>   DW_AT_ranges      : 0x2c
    <ada>   DW_AT_low_pc      : 0
    <ade>   DW_AT_stmt_list   : 0xb65
    <ae2>   DW_AT_macros      : 0x193a6
 <1><ae6>: Abbrev Number: 1 (DW_TAG_base_type)
    <ae7>   DW_AT_byte_size   : 1
    <ae8>   DW_AT_encoding    : 6	(signed char)
    <ae9>   DW_AT_name        : (indirect string, offset: 0x4dc40): signed char
 <1><aed>: Abbrev Number: 1 (DW_TAG_base_type)
    <aee>   DW_AT_byte_size   : 1
    <aef>   DW_AT_encoding    : 8	(unsigned char)
    <af0>   DW_AT_name        : (indirect string, offset: 0x1f716): unsigned char
 <1><af4>: Abbrev Number: 1 (DW_TAG_base_type)
    <af5>   DW_AT_byte_size   : 2
    <af6>   DW_AT_encoding    : 5	(signed)
    <af7>   DW_AT_name        : (indirect string, offset: 0x74130): short int
 <1><afb>: Abbrev Number: 1 (DW_TAG_base_type)
    <afc>   DW_AT_byte_size   : 2
    <afd>   DW_AT_encoding    : 7	(unsigned)
    <afe>   DW_AT_name        : (indirect string, offset: 0x33271): short unsigned int
 <1><b02>: Abbrev Number: 2 (DW_TAG_typedef)
    <b03>   DW_AT_name        : (indirect string, offset: 0x9bfa9): __int32_t
    <b07>   DW_AT_decl_file   : 2
    <b08>   DW_AT_decl_line   : 77
    <b09>   DW_AT_decl_column : 24
    <b0a>   DW_AT_type        : <0xb0e>
 <1><b0e>: Abbrev Number: 1 (DW_TAG_base_type)
    <b0f>   DW_AT_byte_size   : 4
    <b10>   DW_AT_encoding    : 5	(signed)
    <b11>   DW_AT_name        : (indirect string, offset: 0xd726): long int
 <1><b15>: Abbrev Number: 1 (DW_TAG_base_type)
    <b16>   DW_AT_byte_size   : 4
    <b17>   DW_AT_encoding    : 7	(unsigned)
    <b18>   DW_AT_name        : (indirect string, offset: 0x24e6b): long unsigned int
 <1><b1c>: Abbrev Number: 2 (DW_TAG_typedef)
    <b1d>   DW_AT_name        : (indirect string, offset: 0x9bfc0): __int64_t
    <b21>   DW_AT_decl_file   : 2
    <b22>   DW_AT_decl_line   : 103
    <b23>   DW_AT_decl_column : 24
    <b24>   DW_AT_type        : <0xb28>
 <1><b28>: Abbrev Number: 1 (DW_TAG_base_type)
    <b29>   DW_AT_byte_size   : 8
    <b2a>   DW_AT_encoding    : 5	(signed)
    <b2b>   DW_AT_name        : (indirect string, offset: 0x47613): long long int
 <1><b2f>: Abbrev Number: 1 (DW_TAG_base_type)
    <b30>   DW_AT_byte_size   : 8
    <b31>   DW_AT_encoding    : 7	(unsigned)
    <b32>   DW_AT_name        : (indirect string, offset: 0x20177): long long unsigned int
 <1><b36>: Abbrev Number: 10 (DW_TAG_base_type)
    <b37>   DW_AT_byte_size   : 4
    <b38>   DW_AT_encoding    : 5	(signed)
    <b39>   DW_AT_name        : int
 <1><b3d>: Abbrev Number: 1 (DW_TAG_base_type)
    <b3e>   DW_AT_byte_size   : 4
    <b3f>   DW_AT_encoding    : 7	(unsigned)
    <b40>   DW_AT_name        : (indirect string, offset: 0xd026): unsigned int
 <1><b44>: Abbrev Number: 2 (DW_TAG_typedef)
    <b45>   DW_AT_name        : (indirect string, offset: 0x9bfab): int32_t
    <b49>   DW_AT_decl_file   : 3
    <b4a>   DW_AT_decl_line   : 44
    <b4b>   DW_AT_decl_column : 19
    <b4c>   DW_AT_type        : <0xb02>
 <1><b50>: Abbrev Number: 2 (DW_TAG_typedef)
    <b51>   DW_AT_name        : (indirect string, offset: 0x9bfc2): int64_t
    <b55>   DW_AT_decl_file   : 3
    <b56>   DW_AT_decl_line   : 56
    <b57>   DW_AT_decl_column : 19
    <b58>   DW_AT_type        : <0xb1c>
 <1><b5c>: Abbrev Number: 11 (DW_TAG_structure_type)
    <b5d>   DW_AT_byte_size   : 16
    <b5e>   DW_AT_decl_file   : 4
    <b5f>   DW_AT_decl_line   : 16
    <b60>   DW_AT_decl_column : 9
    <b61>   DW_AT_sibling     : <0xb8e>
 <2><b65>: Abbrev Number: 12 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0x9c062): x_hat
    <b6a>   DW_AT_decl_file   : 4
    <b6b>   DW_AT_decl_line   : 17
    <b6c>   DW_AT_decl_column : 13
    <b6d>   DW_AT_type        : <0xb44>
    <b71>   DW_AT_data_member_location: 0
 <2><b72>: Abbrev Number: 4 (DW_TAG_member)
    <b73>   DW_AT_name        : P
    <b75>   DW_AT_decl_file   : 4
    <b75>   DW_AT_decl_line   : 18
    <b76>   DW_AT_decl_column : 13
    <b76>   DW_AT_type        : <0xb44>
    <b7a>   DW_AT_data_member_location: 4
 <2><b7b>: Abbrev Number: 4 (DW_TAG_member)
    <b7c>   DW_AT_name        : Q
    <b7e>   DW_AT_decl_file   : 4
    <b7e>   DW_AT_decl_line   : 19
    <b7f>   DW_AT_decl_column : 13
    <b7f>   DW_AT_type        : <0xb44>
    <b83>   DW_AT_data_member_location: 8
 <2><b84>: Abbrev Number: 4 (DW_TAG_member)
    <b85>   DW_AT_name        : R
    <b87>   DW_AT_decl_file   : 4
    <b87>   DW_AT_decl_line   : 20
    <b88>   DW_AT_decl_column : 13
    <b88>   DW_AT_type        : <0xb44>
    <b8c>   DW_AT_data_member_location: 12
 <2><b8d>: Abbrev Number: 0
 <1><b8e>: Abbrev Number: 2 (DW_TAG_typedef)
    <b8f>   DW_AT_name        : (indirect string, offset: 0x9bfb3): KalmanFilter
    <b93>   DW_AT_decl_file   : 4
    <b94>   DW_AT_decl_line   : 21
    <b95>   DW_AT_decl_column : 3
    <b96>   DW_AT_type        : <0xb5c>
 <1><b9a>: Abbrev Number: 5 (DW_TAG_variable)
    <b9b>   DW_AT_name        : (indirect string, offset: 0x9bfa0): pitch_KF
    <b9f>   DW_AT_decl_file   : 4
    <b9f>   DW_AT_decl_line   : 25
    <ba0>   DW_AT_decl_column : 21
    <ba0>   DW_AT_type        : <0xb8e>
    <ba4>   DW_AT_external    : 1
    <ba4>   DW_AT_declaration : 1
 <1><ba4>: Abbrev Number: 5 (DW_TAG_variable)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x9bff9): roll_KF
    <ba9>   DW_AT_decl_file   : 4
    <ba9>   DW_AT_decl_line   : 26
    <baa>   DW_AT_decl_column : 21
    <baa>   DW_AT_type        : <0xb8e>
    <bae>   DW_AT_external    : 1
    <bae>   DW_AT_declaration : 1
 <1><bae>: Abbrev Number: 5 (DW_TAG_variable)
    <baf>   DW_AT_name        : (indirect string, offset: 0x9bfd9): yaw_KF
    <bb3>   DW_AT_decl_file   : 4
    <bb3>   DW_AT_decl_line   : 27
    <bb4>   DW_AT_decl_column : 21
    <bb4>   DW_AT_type        : <0xb8e>
    <bb8>   DW_AT_external    : 1
    <bb8>   DW_AT_declaration : 1
 <1><bb8>: Abbrev Number: 6 (DW_TAG_variable)
    <bb9>   DW_AT_specification: <0xb9a>
    <bbd>   DW_AT_decl_file   : 1
    <bbd>   DW_AT_decl_line   : 5
    <bbe>   DW_AT_decl_column : 14
    <bbe>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><bc4>: Abbrev Number: 6 (DW_TAG_variable)
    <bc5>   DW_AT_specification: <0xba4>
    <bc9>   DW_AT_decl_file   : 1
    <bc9>   DW_AT_decl_line   : 6
    <bca>   DW_AT_decl_column : 14
    <bca>   DW_AT_location    : 5 byte block: 3 10 0 0 20 	(DW_OP_addr: 20000010)
 <1><bd0>: Abbrev Number: 6 (DW_TAG_variable)
    <bd1>   DW_AT_specification: <0xbae>
    <bd5>   DW_AT_decl_file   : 1
    <bd5>   DW_AT_decl_line   : 7
    <bd6>   DW_AT_decl_column : 14
    <bd6>   DW_AT_location    : 5 byte block: 3 20 0 0 20 	(DW_OP_addr: 20000020)
 <1><bdc>: Abbrev Number: 13 (DW_TAG_subprogram)
    <bdd>   DW_AT_external    : 1
    <bdd>   DW_AT_name        : (indirect string, offset: 0x9c04c): kalman_update
    <be1>   DW_AT_decl_file   : 1
    <be2>   DW_AT_decl_line   : 19
    <be3>   DW_AT_decl_column : 9
    <be4>   DW_AT_prototyped  : 1
    <be4>   DW_AT_type        : <0xb44>
    <be8>   DW_AT_low_pc      : 0x800178c
    <bec>   DW_AT_high_pc     : 0x13e
    <bf0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bf2>   DW_AT_call_all_tail_calls: 1
    <bf2>   DW_AT_sibling     : <0xc39>
 <2><bf6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <bf7>   DW_AT_name        : kf
    <bfa>   DW_AT_decl_file   : 1
    <bfa>   DW_AT_decl_line   : 19
    <bfb>   DW_AT_decl_column : 37
    <bfc>   DW_AT_type        : <0xc39>
    <c00>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><c03>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <c04>   DW_AT_name        : (indirect string, offset: 0x9c040): measurement
    <c08>   DW_AT_decl_file   : 1
    <c08>   DW_AT_decl_line   : 19
    <c09>   DW_AT_decl_column : 49
    <c0a>   DW_AT_type        : <0xb44>
    <c0e>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><c11>: Abbrev Number: 8 (DW_TAG_variable)
    <c12>   DW_AT_name        : (indirect string, offset: 0x9c034): x_hat_minus
    <c16>   DW_AT_decl_file   : 1
    <c16>   DW_AT_decl_line   : 21
    <c17>   DW_AT_decl_column : 13
    <c17>   DW_AT_type        : <0xb44>
    <c1b>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><c1e>: Abbrev Number: 8 (DW_TAG_variable)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x9c001): P_minus
    <c23>   DW_AT_decl_file   : 1
    <c23>   DW_AT_decl_line   : 22
    <c24>   DW_AT_decl_column : 13
    <c24>   DW_AT_type        : <0xb44>
    <c28>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c2b>: Abbrev Number: 14 (DW_TAG_variable)
    <c2c>   DW_AT_name        : K
    <c2e>   DW_AT_decl_file   : 1
    <c2f>   DW_AT_decl_line   : 25
    <c30>   DW_AT_decl_column : 13
    <c31>   DW_AT_type        : <0xb44>
    <c35>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><c38>: Abbrev Number: 0
 <1><c39>: Abbrev Number: 15 (DW_TAG_pointer_type)
    <c3a>   DW_AT_byte_size   : 4
    <c3b>   DW_AT_type        : <0xb8e>
 <1><c3f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c40>   DW_AT_external    : 1
    <c40>   DW_AT_name        : (indirect string, offset: 0x9c009): kalman_init
    <c44>   DW_AT_decl_file   : 1
    <c45>   DW_AT_decl_line   : 11
    <c46>   DW_AT_decl_column : 6
    <c47>   DW_AT_prototyped  : 1
    <c47>   DW_AT_low_pc      : 0
    <c4b>   DW_AT_high_pc     : 0x30
    <c4f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c51>   DW_AT_call_all_calls: 1
 <2><c51>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c52>   DW_AT_name        : kf
    <c55>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 11
    <c56>   DW_AT_decl_column : 32
    <c57>   DW_AT_type        : <0xc39>
    <c5b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><c5e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <c5f>   DW_AT_name        : (indirect string, offset: 0x9c05a): initial_x_hat
    <c63>   DW_AT_decl_file   : 1
    <c63>   DW_AT_decl_line   : 11
    <c64>   DW_AT_decl_column : 44
    <c65>   DW_AT_type        : <0xb44>
    <c69>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><c6c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <c6d>   DW_AT_name        : (indirect string, offset: 0x9bfef): initial_P
    <c71>   DW_AT_decl_file   : 1
    <c71>   DW_AT_decl_line   : 11
    <c72>   DW_AT_decl_column : 67
    <c73>   DW_AT_type        : <0xb44>
    <c77>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c7a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c7b>   DW_AT_name        : Q
    <c7d>   DW_AT_decl_file   : 1
    <c7d>   DW_AT_decl_line   : 11
    <c7e>   DW_AT_decl_column : 86
    <c7f>   DW_AT_type        : <0xb44>
    <c83>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c86>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c87>   DW_AT_name        : R
    <c89>   DW_AT_decl_file   : 1
    <c89>   DW_AT_decl_line   : 11
    <c8a>   DW_AT_decl_column : 97
    <c8b>   DW_AT_type        : <0xb44>
    <c8f>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><c92>: Abbrev Number: 0
 <1><c93>: Abbrev Number: 0
  Compilation Unit @ offset 0xc94:
   Length:        0x1d7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x397
   Pointer Size:  4
 <0><ca0>: Abbrev Number: 5 (DW_TAG_compile_unit)
    <ca1>   DW_AT_producer    : (indirect string, offset: 0x9c0e): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <ca5>   DW_AT_language    : 29	(C11)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x9c110): ../Core/Src/algorithm/pid.c
    <caa>   DW_AT_comp_dir    : (indirect string, offset: 0x1ae85): C:/2_data/VisualStudio/FaHoverBoard/Debug
    <cae>   DW_AT_ranges      : 0x46
    <cb2>   DW_AT_low_pc      : 0
    <cb6>   DW_AT_stmt_list   : 0x10bf
    <cba>   DW_AT_macros      : 0x19419
 <1><cbe>: Abbrev Number: 6 (DW_TAG_structure_type)
    <cbf>   DW_AT_byte_size   : 60
    <cc0>   DW_AT_decl_file   : 2
    <cc1>   DW_AT_decl_line   : 9
    <cc2>   DW_AT_decl_column : 9
    <cc3>   DW_AT_sibling     : <0xd6a>
 <2><cc7>: Abbrev Number: 3 (DW_TAG_member)
    <cc8>   DW_AT_name        : Kp
    <ccb>   DW_AT_decl_file   : 2
    <ccb>   DW_AT_decl_line   : 11
    <ccc>   DW_AT_decl_column : 11
    <ccc>   DW_AT_type        : <0xd6a>
    <cd0>   DW_AT_data_member_location: 0
 <2><cd1>: Abbrev Number: 3 (DW_TAG_member)
    <cd2>   DW_AT_name        : Ki
    <cd5>   DW_AT_decl_file   : 2
    <cd5>   DW_AT_decl_line   : 12
    <cd6>   DW_AT_decl_column : 11
    <cd6>   DW_AT_type        : <0xd6a>
    <cda>   DW_AT_data_member_location: 4
 <2><cdb>: Abbrev Number: 3 (DW_TAG_member)
    <cdc>   DW_AT_name        : Kd
    <cdf>   DW_AT_decl_file   : 2
    <cdf>   DW_AT_decl_line   : 13
    <ce0>   DW_AT_decl_column : 11
    <ce0>   DW_AT_type        : <0xd6a>
    <ce4>   DW_AT_data_member_location: 8
 <2><ce5>: Abbrev Number: 3 (DW_TAG_member)
    <ce6>   DW_AT_name        : err
    <cea>   DW_AT_decl_file   : 2
    <cea>   DW_AT_decl_line   : 16
    <ceb>   DW_AT_decl_column : 11
    <ceb>   DW_AT_type        : <0xd6a>
    <cef>   DW_AT_data_member_location: 12
 <2><cf0>: Abbrev Number: 1 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x9c078): err_prev1
    <cf5>   DW_AT_decl_file   : 2
    <cf5>   DW_AT_decl_line   : 17
    <cf6>   DW_AT_decl_column : 11
    <cf6>   DW_AT_type        : <0xd6a>
    <cfa>   DW_AT_data_member_location: 16
 <2><cfb>: Abbrev Number: 1 (DW_TAG_member)
    <cfc>   DW_AT_name        : (indirect string, offset: 0x9c14a): err_prev2
    <d00>   DW_AT_decl_file   : 2
    <d00>   DW_AT_decl_line   : 18
    <d01>   DW_AT_decl_column : 11
    <d01>   DW_AT_type        : <0xd6a>
    <d05>   DW_AT_data_member_location: 20
 <2><d06>: Abbrev Number: 1 (DW_TAG_member)
    <d07>   DW_AT_name        : (indirect string, offset: 0x9c071): output
    <d0b>   DW_AT_decl_file   : 2
    <d0b>   DW_AT_decl_line   : 21
    <d0c>   DW_AT_decl_column : 11
    <d0c>   DW_AT_type        : <0xd6a>
    <d10>   DW_AT_data_member_location: 24
 <2><d11>: Abbrev Number: 1 (DW_TAG_member)
    <d12>   DW_AT_name        : (indirect string, offset: 0x9c096): output_prev
    <d16>   DW_AT_decl_file   : 2
    <d16>   DW_AT_decl_line   : 22
    <d17>   DW_AT_decl_column : 11
    <d17>   DW_AT_type        : <0xd6a>
    <d1b>   DW_AT_data_member_location: 28
 <2><d1c>: Abbrev Number: 1 (DW_TAG_member)
    <d1d>   DW_AT_name        : (indirect string, offset: 0x9c082): integral
    <d21>   DW_AT_decl_file   : 2
    <d21>   DW_AT_decl_line   : 23
    <d22>   DW_AT_decl_column : 11
    <d22>   DW_AT_type        : <0xd6a>
    <d26>   DW_AT_data_member_location: 32
 <2><d27>: Abbrev Number: 1 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0x9c105): output_max
    <d2c>   DW_AT_decl_file   : 2
    <d2c>   DW_AT_decl_line   : 26
    <d2d>   DW_AT_decl_column : 11
    <d2d>   DW_AT_type        : <0xd6a>
    <d31>   DW_AT_data_member_location: 36
 <2><d32>: Abbrev Number: 1 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0x9c08b): output_min
    <d37>   DW_AT_decl_file   : 2
    <d37>   DW_AT_decl_line   : 27
    <d38>   DW_AT_decl_column : 11
    <d38>   DW_AT_type        : <0xd6a>
    <d3c>   DW_AT_data_member_location: 40
 <2><d3d>: Abbrev Number: 1 (DW_TAG_member)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x9c154): integral_max
    <d42>   DW_AT_decl_file   : 2
    <d42>   DW_AT_decl_line   : 28
    <d43>   DW_AT_decl_column : 11
    <d43>   DW_AT_type        : <0xd6a>
    <d47>   DW_AT_data_member_location: 44
 <2><d48>: Abbrev Number: 1 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0x9c0e3): integral_min
    <d4d>   DW_AT_decl_file   : 2
    <d4d>   DW_AT_decl_line   : 29
    <d4e>   DW_AT_decl_column : 11
    <d4e>   DW_AT_type        : <0xd6a>
    <d52>   DW_AT_data_member_location: 48
 <2><d53>: Abbrev Number: 1 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0x9c135): filter_k
    <d58>   DW_AT_decl_file   : 2
    <d58>   DW_AT_decl_line   : 30
    <d59>   DW_AT_decl_column : 11
    <d59>   DW_AT_type        : <0xd6a>
    <d5d>   DW_AT_data_member_location: 52
 <2><d5e>: Abbrev Number: 1 (DW_TAG_member)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x9c13e): diff_filter
    <d63>   DW_AT_decl_file   : 2
    <d63>   DW_AT_decl_line   : 33
    <d64>   DW_AT_decl_column : 11
    <d64>   DW_AT_type        : <0xd6a>
    <d68>   DW_AT_data_member_location: 56
 <2><d69>: Abbrev Number: 0
 <1><d6a>: Abbrev Number: 7 (DW_TAG_base_type)
    <d6b>   DW_AT_byte_size   : 4
    <d6c>   DW_AT_encoding    : 4	(float)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x85cf8): float
 <1><d71>: Abbrev Number: 8 (DW_TAG_typedef)
    <d72>   DW_AT_name        : (indirect string, offset: 0x9c0ac): PID_HandleTypeDef
    <d76>   DW_AT_decl_file   : 2
    <d77>   DW_AT_decl_line   : 34
    <d78>   DW_AT_decl_column : 3
    <d79>   DW_AT_type        : <0xcbe>
 <1><d7d>: Abbrev Number: 9 (DW_TAG_subprogram)
    <d7e>   DW_AT_external    : 1
    <d7e>   DW_AT_name        : (indirect string, offset: 0x9c0a2): PID_Reset
    <d82>   DW_AT_decl_file   : 1
    <d83>   DW_AT_decl_line   : 98
    <d84>   DW_AT_decl_column : 6
    <d85>   DW_AT_prototyped  : 1
    <d85>   DW_AT_low_pc      : 0
    <d89>   DW_AT_high_pc     : 0x4a
    <d8d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d8f>   DW_AT_call_all_calls: 1
    <d8f>   DW_AT_sibling     : <0xda2>
 <2><d93>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d94>   DW_AT_name        : pid
    <d98>   DW_AT_decl_file   : 1
    <d98>   DW_AT_decl_line   : 98
    <d99>   DW_AT_decl_column : 35
    <d9a>   DW_AT_type        : <0xda2>
    <d9e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><da1>: Abbrev Number: 0
 <1><da2>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <da3>   DW_AT_byte_size   : 4
    <da4>   DW_AT_type        : <0xd71>
 <1><da8>: Abbrev Number: 11 (DW_TAG_subprogram)
    <da9>   DW_AT_external    : 1
    <da9>   DW_AT_name        : (indirect string, offset: 0x9c0be): PID_Calculate
    <dad>   DW_AT_decl_file   : 1
    <dae>   DW_AT_decl_line   : 44
    <daf>   DW_AT_decl_column : 7
    <db0>   DW_AT_prototyped  : 1
    <db0>   DW_AT_type        : <0xd6a>
    <db4>   DW_AT_low_pc      : 0x8001960
    <db8>   DW_AT_high_pc     : 0x118
    <dbc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dbe>   DW_AT_call_all_tail_calls: 1
    <dbe>   DW_AT_sibling     : <0xdfc>
 <2><dc2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc3>   DW_AT_name        : pid
    <dc7>   DW_AT_decl_file   : 1
    <dc7>   DW_AT_decl_line   : 44
    <dc8>   DW_AT_decl_column : 40
    <dc9>   DW_AT_type        : <0xda2>
    <dcd>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><dd0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dd1>   DW_AT_name        : set
    <dd5>   DW_AT_decl_file   : 1
    <dd5>   DW_AT_decl_line   : 44
    <dd6>   DW_AT_decl_column : 51
    <dd7>   DW_AT_type        : <0xd6a>
    <ddb>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><dde>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x9c12c): feedback
    <de3>   DW_AT_decl_file   : 1
    <de3>   DW_AT_decl_line   : 44
    <de4>   DW_AT_decl_column : 62
    <de5>   DW_AT_type        : <0xd6a>
    <de9>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><dec>: Abbrev Number: 12 (DW_TAG_variable)
    <ded>   DW_AT_name        : (indirect string, offset: 0x9c0db): delta_u
    <df1>   DW_AT_decl_file   : 1
    <df2>   DW_AT_decl_line   : 70
    <df3>   DW_AT_decl_column : 11
    <df4>   DW_AT_type        : <0xd6a>
    <df8>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><dfb>: Abbrev Number: 0
 <1><dfc>: Abbrev Number: 13 (DW_TAG_subprogram)
    <dfd>   DW_AT_external    : 1
    <dfd>   DW_AT_name        : (indirect string, offset: 0x9c068): PID_Init
    <e01>   DW_AT_decl_file   : 1
    <e02>   DW_AT_decl_line   : 13
    <e03>   DW_AT_decl_column : 6
    <e04>   DW_AT_prototyped  : 1
    <e04>   DW_AT_low_pc      : 0x80018ca
    <e08>   DW_AT_high_pc     : 0x96
    <e0c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e0e>   DW_AT_call_all_tail_calls: 1
 <2><e0e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e0f>   DW_AT_name        : pid
    <e13>   DW_AT_decl_file   : 1
    <e13>   DW_AT_decl_line   : 13
    <e14>   DW_AT_decl_column : 34
    <e15>   DW_AT_type        : <0xda2>
    <e19>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e1c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e1d>   DW_AT_name        : Kp
    <e20>   DW_AT_decl_file   : 1
    <e20>   DW_AT_decl_line   : 13
    <e21>   DW_AT_decl_column : 45
    <e22>   DW_AT_type        : <0xd6a>
    <e26>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><e29>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2a>   DW_AT_name        : Ki
    <e2d>   DW_AT_decl_file   : 1
    <e2d>   DW_AT_decl_line   : 13
    <e2e>   DW_AT_decl_column : 55
    <e2f>   DW_AT_type        : <0xd6a>
    <e33>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e36>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e37>   DW_AT_name        : Kd
    <e3a>   DW_AT_decl_file   : 1
    <e3a>   DW_AT_decl_line   : 13
    <e3b>   DW_AT_decl_column : 65
    <e3c>   DW_AT_type        : <0xd6a>
    <e40>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e43>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e44>   DW_AT_name        : (indirect string, offset: 0x9c105): output_max
    <e48>   DW_AT_decl_file   : 1
    <e48>   DW_AT_decl_line   : 14
    <e49>   DW_AT_decl_column : 21
    <e4a>   DW_AT_type        : <0xd6a>
    <e4e>   DW_AT_location    : 2 byte block: 91 0 	(DW_OP_fbreg: 0)
 <2><e51>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e52>   DW_AT_name        : (indirect string, offset: 0x9c08b): output_min
    <e56>   DW_AT_decl_file   : 1
    <e56>   DW_AT_decl_line   : 14
    <e57>   DW_AT_decl_column : 39
    <e58>   DW_AT_type        : <0xd6a>
    <e5c>   DW_AT_location    : 2 byte block: 91 4 	(DW_OP_fbreg: 4)
 <2><e5f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e60>   DW_AT_name        : (indirect string, offset: 0x9c135): filter_k
    <e64>   DW_AT_decl_file   : 1
    <e64>   DW_AT_decl_line   : 14
    <e65>   DW_AT_decl_column : 57
    <e66>   DW_AT_type        : <0xd6a>
    <e6a>   DW_AT_location    : 2 byte block: 91 8 	(DW_OP_fbreg: 8)
 <2><e6d>: Abbrev Number: 0
 <1><e6e>: Abbrev Number: 0
  Compilation Unit @ offset 0xe6f:
   Length:        0x1139 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x48b
   Pointer Size:  4
 <0><e7b>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <e7c>   DW_AT_producer    : (indirect string, offset: 0x9c0e): GNU C11 13.3.1 20240614 -mcpu=cortex-m3 -mfloat-abi=soft -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e80>   DW_AT_language    : 29	(C11)
    <e81>   DW_AT_name        : (indirect string, offset: 0x9c83f): ../Core/Src/freertos.c
    <e85>   DW_AT_comp_dir    : (indirect string, offset: 0x1ae85): C:/2_data/VisualStudio/FaHoverBoard/Debug
    <e89>   DW_AT_ranges      : 0x67
    <e8d>   DW_AT_low_pc      : 0
    <e91>   DW_AT_stmt_list   : 0x120f
    <e95>   DW_AT_macros      : 0x19443
 <1><e99>: Abbrev Number: 38 (DW_TAG_base_type)
    <e9a>   DW_AT_byte_size   : 4
    <e9b>   DW_AT_encoding    : 5	(signed)
    <e9c>   DW_AT_name        : int
 <1><ea0>: Abbrev Number: 5 (DW_TAG_typedef)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x6f8e): size_t
    <ea5>   DW_AT_decl_file   : 2
    <ea6>   DW_AT_decl_line   : 214
    <ea7>   DW_AT_decl_column : 23
    <ea8>   DW_AT_type        : <0xeac>
 <1><eac>: Abbrev Number: 10 (DW_TAG_base_type)
    <ead>   DW_AT_byte_size   : 4
    <eae>   DW_AT_encoding    : 7	(unsigned)
    <eaf>   DW_AT_name        : (indirect string, offset: 0xd026): unsigned int
 <1><eb3>: Abbrev Number: 10 (DW_TAG_base_type)
    <eb4>   DW_AT_byte_size   : 8
    <eb5>   DW_AT_encoding    : 5	(signed)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x47613): long long int
 <1><eba>: Abbrev Number: 10 (DW_TAG_base_type)
    <ebb>   DW_AT_byte_size   : 8
    <ebc>   DW_AT_encoding    : 4	(float)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x38a1b): long double
 <1><ec1>: Abbrev Number: 10 (DW_TAG_base_type)
    <ec2>   DW_AT_byte_size   : 1
    <ec3>   DW_AT_encoding    : 6	(signed char)
    <ec4>   DW_AT_name        : (indirect string, offset: 0x4dc40): signed char
 <1><ec8>: Abbrev Number: 10 (DW_TAG_base_type)
    <ec9>   DW_AT_byte_size   : 1
    <eca>   DW_AT_encoding    : 8	(unsigned char)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x1f716): unsigned char
 <1><ecf>: Abbrev Number: 5 (DW_TAG_typedef)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x7c4dc): __int16_t
    <ed4>   DW_AT_decl_file   : 3
    <ed5>   DW_AT_decl_line   : 55
    <ed6>   DW_AT_decl_column : 24
    <ed7>   DW_AT_type        : <0xedb>
 <1><edb>: Abbrev Number: 10 (DW_TAG_base_type)
    <edc>   DW_AT_byte_size   : 2
    <edd>   DW_AT_encoding    : 5	(signed)
    <ede>   DW_AT_name        : (indirect string, offset: 0x74130): short int
 <1><ee2>: Abbrev Number: 5 (DW_TAG_typedef)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x9c94f): __uint16_t
    <ee7>   DW_AT_decl_file   : 3
    <ee8>   DW_AT_decl_line   : 57
    <ee9>   DW_AT_decl_column : 25
    <eea>   DW_AT_type        : <0xeee>
 <1><eee>: Abbrev Number: 10 (DW_TAG_base_type)
    <eef>   DW_AT_byte_size   : 2
    <ef0>   DW_AT_encoding    : 7	(unsigned)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x33271): short unsigned int
 <1><ef5>: Abbrev Number: 5 (DW_TAG_typedef)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x9bfa9): __int32_t
    <efa>   DW_AT_decl_file   : 3
    <efb>   DW_AT_decl_line   : 77
    <efc>   DW_AT_decl_column : 24
    <efd>   DW_AT_type        : <0xf01>
 <1><f01>: Abbrev Number: 10 (DW_TAG_base_type)
    <f02>   DW_AT_byte_size   : 4
    <f03>   DW_AT_encoding    : 5	(signed)
    <f04>   DW_AT_name        : (indirect string, offset: 0xd726): long int
 <1><f08>: Abbrev Number: 5 (DW_TAG_typedef)
    <f09>   DW_AT_name        : (indirect string, offset: 0x6336a): __uint32_t
    <f0d>   DW_AT_decl_file   : 3
    <f0e>   DW_AT_decl_line   : 79
    <f0f>   DW_AT_decl_column : 25
    <f10>   DW_AT_type        : <0xf14>
 <1><f14>: Abbrev Number: 10 (DW_TAG_base_type)
    <f15>   DW_AT_byte_size   : 4
    <f16>   DW_AT_encoding    : 7	(unsigned)
    <f17>   DW_AT_name        : (indirect string, offset: 0x24e6b): long unsigned int
 <1><f1b>: Abbrev Number: 10 (DW_TAG_base_type)
    <f1c>   DW_AT_byte_size   : 8
    <f1d>   DW_AT_encoding    : 7	(unsigned)
    <f1e>   DW_AT_name        : (indirect string, offset: 0x20177): long long unsigned int
 <1><f22>: Abbrev Number: 5 (DW_TAG_typedef)
    <f23>   DW_AT_name        : (indirect string, offset: 0x7c4de): int16_t
    <f27>   DW_AT_decl_file   : 4
    <f28>   DW_AT_decl_line   : 32
    <f29>   DW_AT_decl_column : 19
    <f2a>   DW_AT_type        : <0xecf>
 <1><f2e>: Abbrev Number: 5 (DW_TAG_typedef)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x719fa): uint16_t
    <f33>   DW_AT_decl_file   : 4
    <f34>   DW_AT_decl_line   : 36
    <f35>   DW_AT_decl_column : 20
    <f36>   DW_AT_type        : <0xee2>
 <1><f3a>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3b>   DW_AT_name        : (indirect string, offset: 0x9bfab): int32_t
    <f3f>   DW_AT_decl_file   : 4
    <f40>   DW_AT_decl_line   : 44
    <f41>   DW_AT_decl_column : 19
    <f42>   DW_AT_type        : <0xef5>
 <1><f46>: Abbrev Number: 5 (DW_TAG_typedef)
    <f47>   DW_AT_name        : (indirect string, offset: 0x712c9): uint32_t
    <f4b>   DW_AT_decl_file   : 4
    <f4c>   DW_AT_decl_line   : 48
    <f4d>   DW_AT_decl_column : 20
    <f4e>   DW_AT_type        : <0xf08>
 <1><f52>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <f53>   DW_AT_type        : <0xf46>
 <1><f57>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <f58>   DW_AT_byte_size   : 4
    <f58>   DW_AT_type        : <0xf5c>
 <1><f5c>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <f5d>   DW_AT_prototyped  : 1
    <f5d>   DW_AT_sibling     : <0xf67>
 <2><f61>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <f62>   DW_AT_type        : <0xf67>
 <2><f66>: Abbrev Number: 0
 <1><f67>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <f68>   DW_AT_byte_size   : 4
 <1><f69>: Abbrev Number: 15 (DW_TAG_const_type)
    <f6a>   DW_AT_type        : <0xf67>
 <1><f6e>: Abbrev Number: 5 (DW_TAG_typedef)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x9cac2): BaseType_t
    <f73>   DW_AT_decl_file   : 5
    <f74>   DW_AT_decl_line   : 56
    <f75>   DW_AT_decl_column : 14
    <f76>   DW_AT_type        : <0xf01>
 <1><f7a>: Abbrev Number: 15 (DW_TAG_const_type)
    <f7b>   DW_AT_type        : <0xf6e>
 <1><f7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <f80>   DW_AT_name        : (indirect string, offset: 0x9cac1): UBaseType_t
    <f84>   DW_AT_decl_file   : 5
    <f85>   DW_AT_decl_line   : 57
    <f86>   DW_AT_decl_column : 23
    <f87>   DW_AT_type        : <0xf14>
 <1><f8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x47e83): TickType_t
    <f90>   DW_AT_decl_file   : 5
    <f91>   DW_AT_decl_line   : 63
    <f92>   DW_AT_decl_column : 19
    <f93>   DW_AT_type        : <0xf46>
 <1><f97>: Abbrev Number: 5 (DW_TAG_typedef)
    <f98>   DW_AT_name        : (indirect string, offset: 0x3f70c): TaskHandle_t
    <f9c>   DW_AT_decl_file   : 6
    <f9d>   DW_AT_decl_line   : 70
    <f9e>   DW_AT_decl_column : 37
    <f9f>   DW_AT_type        : <0xfa3>
 <1><fa3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fa4>   DW_AT_byte_size   : 4
    <fa4>   DW_AT_type        : <0xfa8>
 <1><fa8>: Abbrev Number: 27 (DW_TAG_structure_type)
    <fa9>   DW_AT_name        : (indirect string, offset: 0x9c9e5): tskTaskControlBlock
    <fad>   DW_AT_declaration : 1
 <1><fad>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fae>   DW_AT_byte_size   : 4
    <fae>   DW_AT_type        : <0xfb9>
 <1><fb2>: Abbrev Number: 10 (DW_TAG_base_type)
    <fb3>   DW_AT_byte_size   : 1
    <fb4>   DW_AT_encoding    : 8	(unsigned char)
    <fb5>   DW_AT_name        : (indirect string, offset: 0x3281d): char
 <1><fb9>: Abbrev Number: 15 (DW_TAG_const_type)
    <fba>   DW_AT_type        : <0xfb2>
 <1><fbe>: Abbrev Number: 16 (DW_TAG_structure_type)
    <fbf>   DW_AT_byte_size   : 16
    <fc0>   DW_AT_decl_file   : 7
    <fc1>   DW_AT_decl_line   : 360
    <fc3>   DW_AT_decl_column : 9
    <fc3>   DW_AT_sibling     : <0xffe>
 <2><fc7>: Abbrev Number: 8 (DW_TAG_member)
    <fc8>   DW_AT_name        : CCR
    <fcc>   DW_AT_decl_file   : 7
    <fcc>   DW_AT_decl_line   : 362
    <fce>   DW_AT_decl_column : 17
    <fce>   DW_AT_type        : <0xf52>
    <fd2>   DW_AT_data_member_location: 0
 <2><fd3>: Abbrev Number: 4 (DW_TAG_member)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x3c2f6): CNDTR
    <fd8>   DW_AT_decl_file   : 7
    <fd9>   DW_AT_decl_line   : 363
    <fdb>   DW_AT_decl_column : 17
    <fdc>   DW_AT_type        : <0xf52>
    <fe0>   DW_AT_data_member_location: 4
 <2><fe1>: Abbrev Number: 4 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x958c1): CPAR
    <fe6>   DW_AT_decl_file   : 7
    <fe7>   DW_AT_decl_line   : 364
    <fe9>   DW_AT_decl_column : 17
    <fea>   DW_AT_type        : <0xf52>
    <fee>   DW_AT_data_member_location: 8
 <2><fef>: Abbrev Number: 4 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x5610b): CMAR
    <ff4>   DW_AT_decl_file   : 7
    <ff5>   DW_AT_decl_line   : 365
    <ff7>   DW_AT_decl_column : 17
    <ff8>   DW_AT_type        : <0xf52>
    <ffc>   DW_AT_data_member_location: 12
 <2><ffd>: Abbrev Number: 0
 <1><ffe>: Abbrev Number: 11 (DW_TAG_typedef)
    <fff>   DW_AT_name        : (indirect string, offset: 0x7f1d5): DMA_Channel_TypeDef
    <1003>   DW_AT_decl_file   : 7
    <1004>   DW_AT_decl_line   : 366
    <1006>   DW_AT_decl_column : 3
    <1007>   DW_AT_type        : <0xfbe>
 <1><100b>: Abbrev Number: 16 (DW_TAG_structure_type)
    <100c>   DW_AT_byte_size   : 8
    <100d>   DW_AT_decl_file   : 7
    <100e>   DW_AT_decl_line   : 368
    <1010>   DW_AT_decl_column : 9
    <1010>   DW_AT_sibling     : <0x102f>
 <2><1014>: Abbrev Number: 8 (DW_TAG_member)
    <1015>   DW_AT_name        : ISR
    <1019>   DW_AT_decl_file   : 7
    <1019>   DW_AT_decl_line   : 370
    <101b>   DW_AT_decl_column : 17
    <101b>   DW_AT_type        : <0xf52>
    <101f>   DW_AT_data_member_location: 0
 <2><1020>: Abbrev Number: 4 (DW_TAG_member)
    <1021>   DW_AT_name        : (indirect string, offset: 0x6d14c): IFCR
    <1025>   DW_AT_decl_file   : 7
    <1026>   DW_AT_decl_line   : 371
    <1028>   DW_AT_decl_column : 17
    <1029>   DW_AT_type        : <0xf52>
    <102d>   DW_AT_data_member_location: 4
 <2><102e>: Abbrev Number: 0
 <1><102f>: Abbrev Number: 11 (DW_TAG_typedef)
    <1030>   DW_AT_name        : (indirect string, offset: 0x38a57): DMA_TypeDef
    <1034>   DW_AT_decl_file   : 7
    <1035>   DW_AT_decl_line   : 372
    <1037>   DW_AT_decl_column : 3
    <1038>   DW_AT_type        : <0x100b>
 <1><103c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <103d>   DW_AT_byte_size   : 28
    <103e>   DW_AT_decl_file   : 7
    <103f>   DW_AT_decl_line   : 480
    <1041>   DW_AT_decl_column : 9
    <1041>   DW_AT_sibling     : <0x109e>
 <2><1045>: Abbrev Number: 8 (DW_TAG_member)
    <1046>   DW_AT_name        : CRL
    <104a>   DW_AT_decl_file   : 7
    <104a>   DW_AT_decl_line   : 482
    <104c>   DW_AT_decl_column : 17
    <104c>   DW_AT_type        : <0xf52>
    <1050>   DW_AT_data_member_location: 0
 <2><1051>: Abbrev Number: 8 (DW_TAG_member)
    <1052>   DW_AT_name        : CRH
    <1056>   DW_AT_decl_file   : 7
    <1056>   DW_AT_decl_line   : 483
    <1058>   DW_AT_decl_column : 17
    <1058>   DW_AT_type        : <0xf52>
    <105c>   DW_AT_data_member_location: 4
 <2><105d>: Abbrev Number: 8 (DW_TAG_member)
    <105e>   DW_AT_name        : IDR
    <1062>   DW_AT_decl_file   : 7
    <1062>   DW_AT_decl_line   : 484
    <1064>   DW_AT_decl_column : 17
    <1064>   DW_AT_type        : <0xf52>
    <1068>   DW_AT_data_member_location: 8
 <2><1069>: Abbrev Number: 8 (DW_TAG_member)
    <106a>   DW_AT_name        : ODR
    <106e>   DW_AT_decl_file   : 7
    <106e>   DW_AT_decl_line   : 485
    <1070>   DW_AT_decl_column : 17
    <1070>   DW_AT_type        : <0xf52>
    <1074>   DW_AT_data_member_location: 12
 <2><1075>: Abbrev Number: 4 (DW_TAG_member)
    <1076>   DW_AT_name        : (indirect string, offset: 0x9c3ec): BSRR
    <107a>   DW_AT_decl_file   : 7
    <107b>   DW_AT_decl_line   : 486
    <107d>   DW_AT_decl_column : 17
    <107e>   DW_AT_type        : <0xf52>
    <1082>   DW_AT_data_member_location: 16
 <2><1083>: Abbrev Number: 8 (DW_TAG_member)
    <1084>   DW_AT_name        : BRR
    <1088>   DW_AT_decl_file   : 7
    <1088>   DW_AT_decl_line   : 487
    <108a>   DW_AT_decl_column : 17
    <108a>   DW_AT_type        : <0xf52>
    <108e>   DW_AT_data_member_location: 20
